{"url":"https://api.github.com/repos/rust-random/rand/issues/699","repository_url":"https://api.github.com/repos/rust-random/rand","labels_url":"https://api.github.com/repos/rust-random/rand/issues/699/labels{/name}","comments_url":"https://api.github.com/repos/rust-random/rand/issues/699/comments","events_url":"https://api.github.com/repos/rust-random/rand/issues/699/events","html_url":"https://github.com/rust-random/rand/issues/699","id":400204882,"node_id":"MDU6SXNzdWU0MDAyMDQ4ODI=","number":699,"title":"JitterRng security","user":{"login":"tarcieri","id":797,"node_id":"MDQ6VXNlcjc5Nw==","avatar_url":"https://avatars.githubusercontent.com/u/797?v=4","gravatar_id":"","url":"https://api.github.com/users/tarcieri","html_url":"https://github.com/tarcieri","followers_url":"https://api.github.com/users/tarcieri/followers","following_url":"https://api.github.com/users/tarcieri/following{/other_user}","gists_url":"https://api.github.com/users/tarcieri/gists{/gist_id}","starred_url":"https://api.github.com/users/tarcieri/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/tarcieri/subscriptions","organizations_url":"https://api.github.com/users/tarcieri/orgs","repos_url":"https://api.github.com/users/tarcieri/repos","events_url":"https://api.github.com/users/tarcieri/events{/privacy}","received_events_url":"https://api.github.com/users/tarcieri/received_events","type":"User","user_view_type":"public","site_admin":false},"labels":[{"id":7228877272,"node_id":"LA_kwDOAc09Ts8AAAABrt_p2A","url":"https://api.github.com/repos/rust-random/rand/labels/X-security","name":"X-security","color":"bfbfbf","default":false,"description":"Security discussion"}],"state":"closed","locked":false,"assignee":null,"assignees":[],"milestone":null,"comments":16,"created_at":"2019-01-17T10:21:22Z","updated_at":"2024-07-20T11:47:31Z","closed_at":"2019-06-03T17:15:16Z","author_association":"CONTRIBUTOR","type":null,"active_lock_reason":null,"sub_issues_summary":{"total":0,"completed":0,"percent_completed":0},"issue_dependencies_summary":{"blocked_by":0,"total_blocked_by":0,"blocking":0,"total_blocking":0},"body":"Splitting this discussion off from #681, I'd like to ask the question: is JitterRng secure enough to be considered a `CryptoRng`?\r\n\r\nhttps://github.com/rust-random/rand/issues/681#issuecomment-455088763\r\n\r\n> JitterRng uses the high-resolution part of nano-second timers. As far as I can tell, JavaScript cannot even access nanosecond timers in the browser.\r\n\r\nJavaScript is just one example of a way an attacker could either influence the TRNG, or establish a covert channel to read its state. Cotenant VMs are another example. Even without a high precision timer, an attacker can still attempt to actively influence the RNG's output, and if they can establish any sort of signal that the attack is working, or starting to work, even if statistical, they can use that as part of a bidirectional feedback loop to tune the attack.\r\n\r\nI read the \"paper\" on the design JitterRng is supposed to be based on, `jitterentropy-library`:\r\n\r\nhttp://www.chronox.de/jent/doc/CPU-Jitter-NPTRNG.pdf\r\n\r\nSidechannel attacks aren't discussed whatsoever, and don't seem to be considered. Quite the opposite. From section 7.1:\r\n\r\n> Direct readout of random number or the internal state of the CPU Jitter random number generator: This approach can be immediately refuted as the random number generator relies on the process separation and memory isolation offered by contemporary operating systems.\r\n\r\nThere have been a number of recent attacks which allow data to be exfiltrated across process boundaries via covert channels, namely Meltdown, Spectre, and Foreshadow. Variations of these attacks are being discovered on a frequent basis... the newest attack sidechannel attack on Intel CPUs, a sidechannel based on Integrated Performance Primitives, was just announced a few days ago.\r\n\r\nIt also non-chalantly cites HAVEGEd as related work, when it is somewhat notorious for failing to live up to its claims and being a potential source of poor random numbers, and is implicated in a PolarSSL CVE:\r\n\r\nhttps://lwn.net/Articles/525459/\r\nhttps://tls.mbed.org/tech-updates/security-advisories/polarssl-security-advisory-2011-02\r\n\r\nSection 7.1.1 describes the general attack I had been discussing earlier in #681, but it makes a number of assumptions I don't think hold:\r\n\r\n> Comparing the attack process readings with a fully unobserved process indicates that the attacking process can never determine the victim’s time stamps more accurate than the CPU execution time jitter our random number generator is based on. An attacking process is never be able to reduce the variations of the CPU execution time jitter.\r\n\r\nThe analysis in this section is rather handwavy and assumes quite a bit about how an attack would work as if it were the only way. I see a real risks in how many of the inputs to JitterRng an attacker can potentially influence, and the potential number of ways the attacker could leverage minute statistical signals to tune these attacks.\r\n\r\nUnfortunately, most papers on \"TRNGs\" I'm reading on ePrint describe purpose designed hardware RNGs, and though I have seen the term \"TRNG\" used for HAVEGEd-style entropy collectors in the past, I'm really beginning to wonder if this is a misnomer.\r\n\r\nRegardless, here's a paper that puts forth a much more rigorous framework for evaluating TRNGs:\r\n\r\nhttps://eprint.iacr.org/2009/299.pdf\r\n\r\nAnd here's a paper that demonstrates a number of different attacks against hardware TRNGs, some of which are remotely exploitable:\r\n\r\nhttp://eprints.whiterose.ac.uk/117858/7/micpro_IoT.pdf\r\n\r\nSome of these attacks leverage the statistical techniques I was alluding to / guessing about earlier, and could potentially be adapted to something like `JitterRng`.\r\n\r\n> Your first article on GAROs sounds like it is observational rather than a definitive proof?\r\n\r\nI think the burden of proof for security is ultimately on the RNG implementation. If I can't conceive of a practical attack, that doesn't make something secure, it means we don't know.\r\n\r\nFor a positive result, we'd need to prove or otherwise demonstrate properties of `JitterRng`.\r\n\r\nBased on reading a few papers tonight, I think the state of affairs for these sorts of (pseudo-)TRNGs is in fact significantly worse than I had realized. If anyone has done a rigorous analysis of HAVEGEd-style software-based TRNGs, as opposed to hardware based ones, I've been unable to find it. The author of this library did not do such an analysis, and the quality of his paper is poor. Furthermore it does not seem to acknowledge or learn from past failures of HAVEGEd.\r\n\r\nThe security of these sorts of RNGs seems to rest entirely on an assumption: that modern CPUs are too noisy to be predicted, even when an attacker is able to directly influence their behavior via code running on the same CPU. I do not think this is a sound assumption.\r\n\r\nI would consider the library `JitterRng` is based on to be of questionable provenance, not learning from the mistakes of its predecessors, and fundamentally trying to do something I consider to be very scary: generate random numbers out of potentially attacker-controlled / influenced values, and also avoid leaking them through microarchitectural sidechannels.\r\n\r\nThe main way we'd avoid the latter is by using a constant-time implementation which avoids secret-dependent branching, however branching on values `JitterRng` intends to use as \"random\" secrets seems to be integral to the way it functions:\r\n\r\nhttps://github.com/rust-random/rand/blob/a7c2eae35e7d547bbe3b1ba766d9351f0c97eae8/src/rngs/jitter.rs#L634-L675\r\n\r\ntl;dr: `JitterRng` seems rather scary to me, and I personally do not consider it of high enough quality to be considered a `CryptoRng`, and would like to ensure it is not accidentally used in place of an OS-provided RNG in any of my cryptography projects consuming `rand_os`.","closed_by":{"login":"dhardy","id":134893,"node_id":"MDQ6VXNlcjEzNDg5Mw==","avatar_url":"https://avatars.githubusercontent.com/u/134893?v=4","gravatar_id":"","url":"https://api.github.com/users/dhardy","html_url":"https://github.com/dhardy","followers_url":"https://api.github.com/users/dhardy/followers","following_url":"https://api.github.com/users/dhardy/following{/other_user}","gists_url":"https://api.github.com/users/dhardy/gists{/gist_id}","starred_url":"https://api.github.com/users/dhardy/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/dhardy/subscriptions","organizations_url":"https://api.github.com/users/dhardy/orgs","repos_url":"https://api.github.com/users/dhardy/repos","events_url":"https://api.github.com/users/dhardy/events{/privacy}","received_events_url":"https://api.github.com/users/dhardy/received_events","type":"User","user_view_type":"public","site_admin":false},"reactions":{"url":"https://api.github.com/repos/rust-random/rand/issues/699/reactions","total_count":7,"+1":7,"-1":0,"laugh":0,"hooray":0,"confused":0,"heart":0,"rocket":0,"eyes":0},"timeline_url":"https://api.github.com/repos/rust-random/rand/issues/699/timeline","performed_via_github_app":null,"state_reason":"completed"}