{"url":"https://api.github.com/repos/bevyengine/bevy/issues/14826","repository_url":"https://api.github.com/repos/bevyengine/bevy","labels_url":"https://api.github.com/repos/bevyengine/bevy/issues/14826/labels{/name}","comments_url":"https://api.github.com/repos/bevyengine/bevy/issues/14826/comments","events_url":"https://api.github.com/repos/bevyengine/bevy/issues/14826/events","html_url":"https://github.com/bevyengine/bevy/issues/14826","id":2474272770,"node_id":"I_kwDODf6-U86TemgC","number":14826,"title":"Ghost nodes: layout- and rendering-ignored entities in hierarchies","user":{"login":"viridia","id":1166135,"node_id":"MDQ6VXNlcjExNjYxMzU=","avatar_url":"https://avatars.githubusercontent.com/u/1166135?v=4","gravatar_id":"","url":"https://api.github.com/users/viridia","html_url":"https://github.com/viridia","followers_url":"https://api.github.com/users/viridia/followers","following_url":"https://api.github.com/users/viridia/following{/other_user}","gists_url":"https://api.github.com/users/viridia/gists{/gist_id}","starred_url":"https://api.github.com/users/viridia/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/viridia/subscriptions","organizations_url":"https://api.github.com/users/viridia/orgs","repos_url":"https://api.github.com/users/viridia/repos","events_url":"https://api.github.com/users/viridia/events{/privacy}","received_events_url":"https://api.github.com/users/viridia/received_events","type":"User","user_view_type":"public","site_admin":false},"labels":[{"id":1795619326,"node_id":"MDU6TGFiZWwxNzk1NjE5MzI2","url":"https://api.github.com/repos/bevyengine/bevy/labels/C-Feature","name":"C-Feature","color":"b8b8b8","default":false,"description":"A new feature, making something new possible"},{"id":2276469463,"node_id":"MDU6TGFiZWwyMjc2NDY5NDYz","url":"https://api.github.com/repos/bevyengine/bevy/labels/A-UI","name":"A-UI","color":"c6a751","default":false,"description":"Graphical user interfaces, styles, layouts, and widgets"},{"id":2747857990,"node_id":"MDU6TGFiZWwyNzQ3ODU3OTkw","url":"https://api.github.com/repos/bevyengine/bevy/labels/C-Usability","name":"C-Usability","color":"b8b8b8","default":false,"description":"A targeted quality-of-life change that makes Bevy easier to use"},{"id":3166152189,"node_id":"MDU6TGFiZWwzMTY2MTUyMTg5","url":"https://api.github.com/repos/bevyengine/bevy/labels/S-Needs-Design","name":"S-Needs-Design","color":"D876E3","default":false,"description":"This issue requires design work to think about how it would best be accomplished"}],"state":"closed","locked":false,"assignee":null,"assignees":[],"milestone":null,"comments":14,"created_at":"2024-08-19T21:51:15Z","updated_at":"2024-10-02T00:41:27Z","closed_at":"2024-10-02T00:41:27Z","author_association":"CONTRIBUTOR","type":null,"active_lock_reason":null,"sub_issues_summary":{"total":0,"completed":0,"percent_completed":0},"issue_dependencies_summary":{"blocked_by":0,"total_blocked_by":0,"blocking":0,"total_blocking":0},"body":"This is a follow-up to an issue I filed and then closed a long time ago: #9731 The reason I closed the issue was that I was able to find a workaround; however, I'm re-opening the issue in modified form because the workaround is making my code much more complex than it needs to be.\r\n\r\nFirst, let me describe what I mean by \"auxiliary\" and \"fragment\" nodes. I'm not sure what's the best word to describe the concept, but the basic idea is that a fragment node is an entity that has a special marker component, or perhaps a special type of visibility, that causes the node to be ignored by the ui layout and rendering code, but allows its children to be displayed in its place. The term \"fragment\" comes from React - a `<Fragment/>` is a special type of JSX element that contains multiple children, but which can be passed around like a single element reference.\r\n\r\nFragment nodes behave like regular entities in all other ways: they can be children of other nodes, they can listen for events, they have have components and children of their own and so on. The only difference is that they are not displayed, but their children are displayed in their place.\r\n\r\nThis has an effect on flexboxes and grids: let's say we have a flexbox node with three children, one of which is a fragment with N children. The flexbox layout algorithm should treat each child of the fragment as if it were a direct child of the flexbox, meaning that in this example the flexbox will have 2+N layout items. If the fragment has a child which is also a fragment, the children of that fragment is also treated as direct children of the flexbox.\r\n\r\nThis also affects scenes: if a fragment node is a child of a SpatialBundle, and has in turn a child which is a MeshBundle, the mesh bundle is rendered as if it were a direct child of the SpatialBundle; there's no warning about the lack of a transform component on the fragment.\r\n\r\n## What problem does this solve or what need does it fill?\r\n\r\nFor a reactive framework, the benefits of fragments are huge: I'd estimate that the amount of code for bevy_reactor and Quill could be reduced by 30-50%.\r\n\r\nThe reason is that these frameworks need to insert special \"housekeeping\" nodes into the entity tree. An if-condition node needs to keep track of the current state of the condition, as well as state information needed to tear down the children when the condition changes. A for-loop node needs to keep around information about the array elements so that it can do a 'diff' when the array changes. Template call nodes need to keep a copy of the template parameters.\r\n\r\nWhy can't these simply be stored as components? Because there might not be any entity available to store them - a conditional branch might render an empty tree, a for-loop might render zero items. Or it might render 100 items. There's no obvious, unambiguous way to annotate the children of these conditional operators on the child nodes.\r\n\r\nFor similar reasons, these aux nodes can't be stored as siblings or on the parent node without creating additional ambiguity or complexity. The only way that really makes sense is to have a special node which dynamically generates its children, and then to somehow mark that node as not being part of the layout.\r\n\r\nThe way I am doing this currently is to maintain an entirely separate tree in parallel which stores these housekeeping nodes. However, this introduces a lot of complexity, because these trees have to cross-link to each other, when you despawn part of one tree you also have to despawn the corresponding part of the other tree. (This is part of the reason why Quill UIs cannot be StateScoped - you can't just call despawn_recursive and expect it not to crash.)\r\n\r\n## What solution would you like?\r\n\r\nOne possible approach is to add a new type of Visibility, such as `Visibility::Fragment`. Another is to have a special marker component. The hard part is modifying the layout / rendering code to recursively traverse into the fragment node.\r\n\r\nThe original proposal was to add a new type of `Display`, but that only fixes the issue for bevy_ui nodes and doesn't address the issue for other kinds of scenes.\r\n\r\nFinally, I want to mention that this may have an impact on BSN. We don't have much details on the reactive strategy for BSN, other than @cart 's comment about favoring a fine-grained approach. However, I have a hard time imagining how BSN is going to be able to implement any kind of dynamic/incremental updates without a way to store template housekeeping information in the entity tree.","closed_by":{"login":"alice-i-cecile","id":3579909,"node_id":"MDQ6VXNlcjM1Nzk5MDk=","avatar_url":"https://avatars.githubusercontent.com/u/3579909?v=4","gravatar_id":"","url":"https://api.github.com/users/alice-i-cecile","html_url":"https://github.com/alice-i-cecile","followers_url":"https://api.github.com/users/alice-i-cecile/followers","following_url":"https://api.github.com/users/alice-i-cecile/following{/other_user}","gists_url":"https://api.github.com/users/alice-i-cecile/gists{/gist_id}","starred_url":"https://api.github.com/users/alice-i-cecile/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/alice-i-cecile/subscriptions","organizations_url":"https://api.github.com/users/alice-i-cecile/orgs","repos_url":"https://api.github.com/users/alice-i-cecile/repos","events_url":"https://api.github.com/users/alice-i-cecile/events{/privacy}","received_events_url":"https://api.github.com/users/alice-i-cecile/received_events","type":"User","user_view_type":"public","site_admin":false},"reactions":{"url":"https://api.github.com/repos/bevyengine/bevy/issues/14826/reactions","total_count":2,"+1":2,"-1":0,"laugh":0,"hooray":0,"confused":0,"heart":0,"rocket":0,"eyes":0},"timeline_url":"https://api.github.com/repos/bevyengine/bevy/issues/14826/timeline","performed_via_github_app":null,"state_reason":"completed"}