{"url":"https://api.github.com/repos/blevesearch/bleve/issues/1350","repository_url":"https://api.github.com/repos/blevesearch/bleve","labels_url":"https://api.github.com/repos/blevesearch/bleve/issues/1350/labels{/name}","comments_url":"https://api.github.com/repos/blevesearch/bleve/issues/1350/comments","events_url":"https://api.github.com/repos/blevesearch/bleve/issues/1350/events","html_url":"https://github.com/blevesearch/bleve/issues/1350","id":582506138,"node_id":"MDU6SXNzdWU1ODI1MDYxMzg=","number":1350,"title":"RFC - Bleve v1.0.0 and Go Modules","user":{"login":"mschoch","id":298143,"node_id":"MDQ6VXNlcjI5ODE0Mw==","avatar_url":"https://avatars.githubusercontent.com/u/298143?v=4","gravatar_id":"","url":"https://api.github.com/users/mschoch","html_url":"https://github.com/mschoch","followers_url":"https://api.github.com/users/mschoch/followers","following_url":"https://api.github.com/users/mschoch/following{/other_user}","gists_url":"https://api.github.com/users/mschoch/gists{/gist_id}","starred_url":"https://api.github.com/users/mschoch/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/mschoch/subscriptions","organizations_url":"https://api.github.com/users/mschoch/orgs","repos_url":"https://api.github.com/users/mschoch/repos","events_url":"https://api.github.com/users/mschoch/events{/privacy}","received_events_url":"https://api.github.com/users/mschoch/received_events","type":"User","user_view_type":"public","site_admin":false},"labels":[],"state":"closed","locked":false,"assignee":null,"assignees":[],"milestone":null,"comments":2,"created_at":"2020-03-16T18:12:00Z","updated_at":"2021-05-19T00:51:53Z","closed_at":"2020-04-05T21:04:00Z","author_association":"CONTRIBUTOR","type":null,"active_lock_reason":null,"sub_issues_summary":{"total":0,"completed":0,"percent_completed":0},"issue_dependencies_summary":{"blocked_by":0,"total_blocked_by":0,"blocking":0,"total_blocking":0},"body":"The Bleve project achieved wide adoption prior to the introduction of Go modules.  As a result, the Bleve team has been careful to not introduce breaking changes.  However, now that Go modules have matured, the community has made it clear that the Bleve project should also adopt them.\r\n\r\nWhile evaluating this change, we determined that this was also the right time to use Go modules to address an important shortcoming in Bleve.  Specifically, Bleve has been limited to a single file format version within a given build.  This is a critical limitation for applications which need to offer backwards compatibility to their end users.  This set of changes leverages Go modules to address this issue.\r\n\r\n**NOTE: This proposal will end support for GOPATH builds of bleve and related projects inside the blevesearch organization on github.**\r\n\r\n## Changes in Detail\r\n\r\n### Support Go Modules\r\n\r\nOn the surface, this can appear as simple as adding a `go.mod` file to the project.  However, when combined with the other changes below, adopting Go modules really requires you to reevaluate all of your dependencies.\r\n\r\nReview the proposed changes to [blevesearch/bleve](https://github.com/blevesearch/bleve/pull/1342)\r\n\r\n### Breakout Zap into separate Module\r\n\r\nBleve has an indexing scheme named `scorch`, and scorch was designed to work with different segment implementations.  As of today there is just a single implementation named `zap`.  Zap was also designed to have a version number, so that the file format could evolve over time.  Unfortunately, although the segment abstraction was put in place, the code was physically nested inside the same repository.  This meant that supporting more than one version at a time would either require if/else logic or copy/paste large sections of code, neither of which would be easy to maintain over time.\r\n\r\nThe much cleaner alternative was to promote `zap` to become its own module.  This allows us to use major versions to delineate incompatible changes with the file format, and use standard git branching and tagging to develop new versions.\r\n\r\nThe version of `zap` used in Bleve today is `11` and has been moved to it's own repo here: \r\n\r\n[zap v11.0.1](https://github.com/blevesearch/zap/tree/v11.0.1)\r\n\r\n### Multiple Versions of Zap supported\r\n\r\nA newer version of `zap` which offers significant space savings is introduced as `12` and this code now exists here:\r\n\r\n[zap v12.0.1](https://github.com/blevesearch/zap/tree/v12.0.1)\r\n\r\nAs mentioned in the previous section, by having `zap` as its own module, and by releasing major versions when the file format changes, it becomes straightforward for Bleve's `scorch` index scheme to import multiple `zap` versions into a single build.  This allows Bleve to introduce a new file format `zap v12` which provides significant space savings.  Crucially, an application can start leveraging this new format, while not giving up the ability to read the previous format.\r\n\r\nThe Bleve project will make decisions about which versions to support, and these will be documented/communicated (see details about Bleve versioning below).\r\n\r\nIn addition, we understand that advanced users may wish to override scorch's supported segment types and versions.  To do this we provide the following API:\r\n\r\n```\r\nfunc RegisterPlugin(plugin segment.Plugin, makeDefault bool)\r\nfunc ResetPlugins()\r\n```\r\n\r\n**NOTE**: These methods must be called during init() and not used beyond that point.\r\n\r\n### Release v1.0.0\r\n\r\nThe proposal is to declare the current Bleve API, and supported file formats `v1.0.0`.  Many users have adopted Bleve already, and introducing any significant changes at this point would be disruptive.\r\n\r\nThis includes the following:\r\n\r\n- `bleve.New()` will continue to default to the `upsidedown` index scheme.  This is no longer recommended for use, but changing the default would break many existing applications.  We do have plans to change this in the future, but that is outside the scope of this document.\r\n- `bleve.NewUsing()` which requests a `scorch` index will continue to default to the `v11` version of `zap`.  Again, this will change in the future, but ensures maximum compatibility for existing applications.\r\n\r\nBecause of this, applications wishing to take advantage of the new version of zap must explicitly opt-in to it's usage with additional index configuration:\r\n\r\n```\r\n\"forceSegmentType\": \"zap\",\r\n\"forceSegmentVersion\": 12\r\n```\r\n\r\nAgain, these decisions have been made for maximum compatibility with existing applications.  By adopting Go modules, we make it possible for us to more clearly communicate these types of changes in the future.\r\n\r\n### Command-line Tools for Zap\r\n\r\nPreviously the `bleve` command-line tool included a sub-command `zap` to investigate the details of a zap segment.  This functionality is now available through a dedicated `zap` command in the `blevesearch/zap` repositories.  This allows you to build a version of the zap command that works with corresponding version.\r\n\r\nIn the future, we may decide to reintroduce this functionality to the main `bleve` command, but for now this is not included.\r\n\r\n### Discontinue support for GOPATH builds of Bleve\r\n\r\nAttempting to build Bleve, or an application using Bleve without Go modules will result in a compilation error.  This is due to Bleve now having dependency on two major versions of the zap module.  The following options are available:\r\n\r\n1.  Upgrade to Go modules.  We understand that this may not be so simple, but we strongly encourage you to consider it, and reach out for help if needed.\r\n\r\n2.  We will create a final release tag of Bleve prior to this change `v0.9.0`.  If you're using a tool like govendor, you may simply be able to point to this tag.  Otherwise, you may find the best option is to create a fork of repository and align the master branch on this fork with the tag we've created.  Then, by using a tool such as [govers](https://github.com/rogpeppe/govers) or [sed](https://www.gnu.org/software/sed/manual/sed.html), rewrite the imports in your application from `blevesearch/bleve` to `yourfork/bleve`.\r\n\r\nFor a period of 6 months, we will ensure that critical bugs are fixed and released on the `v0.9.x` line.\r\n\r\n## Take these Changes for a Test Drive\r\n\r\nWe have been developing these changes on a fork of Bleve (and associated repos) under the [Bluge Labs](https://blugelabs.com) organization.  Our expectation is that users can more easily test these changes by simply adjusting their import path from `github.com/blevesearch/bleve` to `github.com/blugelabs/bleve`.  This repository is not identical, but differs in the following minor ways:\r\n\r\n1. Regular development has proceeded on `blevesearch/bleve` however there are no changes we consider major.\r\n2. Because we were still learning Go modules during development there are many more minor versions released `1.0.1`, `1.0.2`, etc.  However, the major versions will be the same in the proposed changes to Bleve (v1.x) and Zap (v11.x and v12.x)\r\n\r\nThe Bluge Labs organization also contains a version of the [beer-search](https://github.com/blugelabs/beer-search) sample application.  This version of `beer-search` also has a new flag `-forceVersion` which can be used to demonstrate the multiple versions of zap.\r\n\r\nIf you encounter issues using the Bluge Labs fork, we ask you to please let us know (see the Feedback section)\r\n\r\n## Feedback\r\n\r\nYour feedback is essential to us moving forward in a way that benefits the entire Bleve community.\r\n\r\n### Thumbs Up/Down\r\n\r\nYou can react to this issue with a basic thumbs up or down.  This can give us a sense of how well this proposal is received.  However, if you give a thumbs down, we ask that you also provide a comment expanding on your thoughts.\r\n\r\n### Comment\r\n\r\nPlease comment on this issue.  We may not be able to satisfy everyone but we can only address the concerns that are shared with us.\r\n\r\n### Timeline\r\n\r\nWe ask that you provide feedback as soon as possible.  We would like to merge these changes by April 3rd, but are willing to adjust the schedule if significant issues are found\r\n\r\n## Additional Information on Bleve Versioning\r\n\r\nGo modules requires that modules use [Semantic Versioning](https://semver.org/).\r\n\r\nSemantic Versioning requires that you increment the MAJOR verison when you `make incompatible API changes`.\r\n\r\nIt is perhaps obvious that anything which would break compilation would be considered an incompatible API change, however we also feel it should include any incompatible changes to the files created by Bleve.  Users have an expectation that files created by Bleve can be read back in, therefore any time this changes we also plan to increment the MAJOR version number.\r\n\r\nRelated to this, anytime the default behavior changes (say in the future from upsidedown to scorch), this should also be communicated by incrementing the MAJOR version number. \r\n\r\n## TODO\r\n\r\nWe plan to work on these items while this issue is reviewed, but some of them may not be completed until after the merge:\r\n\r\n- [ ] Fix and/or Setup CI for all repositories\r\n- [ ] Review all repositories in blevesearch organization\r\n- [ ] Archive any repositories which will be no longer maintained\r\n- [ ] If not archiving, tag a final `v0.x` version as is, add go.mod and tag as `v1.0.0`\r\n- [ ] Update go.mod in the PR to reflect newly tagged versions in related repos (vellum, segment, etc) \r\n\r\n## Frequently Asked Questions\r\n\r\n### Why did you make `zap` its own repository, Go modules support having multiple modules in the same repository using a naming convention for tags?\r\n\r\nWe envision that Bleve may ultimately be broken up into several more modules, and that having a single repository with this many modules would be come unwieldy.\r\n\r\n### I looked at the go.mod in the blevesearch/bleve PR, and in the blevesearch/zap repos, and it seems like they both depend on each other.  How can that be?\r\n\r\nGo modules actually allows for circular dependencies for modules, provided the underlying packages still do not contain a circular dependency.\r\n\r\nThat said, we still find this undesirable for several reasons, most importantly that when we release a Bleve v2.x we will break all the existing zap plugins for scorch.  We explored adressing this issue now, but found the changes too large and most existing applications would have been broken.\r\n\r\nWe feel making these larger changes in a v2.x or beyond is more appropriate, as we can leverage the MAJOR version number to more clearly communicate the scope of changes to end users.\r\n\r\n### Why have you chosen to implement these changes in a way that breaks GOPATH builds?\r\n\r\nWe spent considerable time trying to avoid this, and as recently as a week ago, thought we had a clever solution to avoid it, but ultimately it was not possible.\r\n\r\nThe proposed solution does not yet introduce a `v2` of bleve, but does rely on multiple major versions of zap `v11` and `v12`.  Further, we envision that in the near future, a deeper reorganization of Bleve will introduce a `v2`.  This leads to what is often referred to as the `v2+` problem.  \r\n\r\nAs described in [Go Modules: v2 and Beyond](https://blog.golang.org/v2-go-modules) the recommended strategy is to develop `v2+` modules in a subdirectory.  \r\n\r\nFor large projects like Bleve, this seems almost ridiculous to consider.  At this time the Bleve repository has over 600 files, having a second copy under a `v2` folder would be an unacceptable inconvenience for developers.  One could argue that Bleve never should have gotten this large in the first place, but here we are, and refactoring that would result in an even larger breaking change.\r\n\r\nCould we have applied this technique to the `v11` folder in zap?  Possibly, but we expect that further versions of zap, or the introduction of Bleve `v2` would ultimately lead to the same ending.\r\n\r\nWe also considered continuing development of Bleve and other modules on branches other than master, so that `go get` could continue to work with the master branch for GOPATH based development.  But ultimately we concluded this creates too much long term negative impact for the the developers of Bleve.\r\n\r\nBased on this, we feel now is the right time to make this incompatible change.","closed_by":{"login":"mschoch","id":298143,"node_id":"MDQ6VXNlcjI5ODE0Mw==","avatar_url":"https://avatars.githubusercontent.com/u/298143?v=4","gravatar_id":"","url":"https://api.github.com/users/mschoch","html_url":"https://github.com/mschoch","followers_url":"https://api.github.com/users/mschoch/followers","following_url":"https://api.github.com/users/mschoch/following{/other_user}","gists_url":"https://api.github.com/users/mschoch/gists{/gist_id}","starred_url":"https://api.github.com/users/mschoch/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/mschoch/subscriptions","organizations_url":"https://api.github.com/users/mschoch/orgs","repos_url":"https://api.github.com/users/mschoch/repos","events_url":"https://api.github.com/users/mschoch/events{/privacy}","received_events_url":"https://api.github.com/users/mschoch/received_events","type":"User","user_view_type":"public","site_admin":false},"reactions":{"url":"https://api.github.com/repos/blevesearch/bleve/issues/1350/reactions","total_count":43,"+1":29,"-1":0,"laugh":0,"hooray":8,"confused":0,"heart":6,"rocket":0,"eyes":0},"timeline_url":"https://api.github.com/repos/blevesearch/bleve/issues/1350/timeline","performed_via_github_app":null,"state_reason":"completed"}