diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/DB2IsolationLevels.out b/java/testing/org/apache/derbyTesting/functionTests/master/DB2IsolationLevels.out
index affa71e66..aeb4147ad 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/DB2IsolationLevels.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/DB2IsolationLevels.out
@@ -533,18 +533,39 @@ None
 ij> -- unknown isolation level
 select * from t1 with rw;
 ERROR 42X01: Syntax error: Encountered "rw" at line 2, column 23.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from t1 with DIRTY READ;
 ERROR 42X01: Syntax error: Encountered "DIRTY" at line 1, column 23.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from t1 with READ UNCOMMITTED;
 ERROR 42X01: Syntax error: Encountered "READ" at line 1, column 23.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from t1 with READ COMMITTED;
 ERROR 42X01: Syntax error: Encountered "READ" at line 1, column 23.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from t1 with CURSOR STABILITY;
 ERROR 42X01: Syntax error: Encountered "CURSOR" at line 1, column 23.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from t1 with REPEATABLE READ;
 ERROR 42X01: Syntax error: Encountered "REPEATABLE" at line 1, column 23.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from t1 with SERIALIZABLE;
 ERROR 42X01: Syntax error: Encountered "SERIALIZABLE" at line 1, column 23.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- check the db2 isolation levels can be used as identifiers
 create table db2iso(cs int, rr int, ur int, rs int);
 0 rows inserted/updated/deleted
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/LOBDB2compatibility.out b/java/testing/org/apache/derbyTesting/functionTests/master/LOBDB2compatibility.out
index a9ec4ef00..460bb471f 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/LOBDB2compatibility.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/LOBDB2compatibility.out
@@ -157,4 +157,7 @@ ERROR 0A000: Feature not implemented: NCLOB.
 ij> -- BIT STRING literal is not allowed in DB2
 values cast(B'1' as blob(10));
 ERROR 42X01: Syntax error: Encountered "\'1\'" at line 2, column 14.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/access.out b/java/testing/org/apache/derbyTesting/functionTests/master/access.out
index 337f183cc..a4465406b 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/access.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/access.out
@@ -2628,6 +2628,9 @@ ij> update t2778 --derby-properties index = a_idx
         '0_col10llllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllll012340_col10lllllllllllxxxxxx'
     where col00 = '0_';
 ERROR 42X01: Syntax error: DERBY-PROPERTIES.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> rollback;
 ij> -- prior to the fix col17 and col18 would come back null.
 select col01, col02, col03, col04, col05,  col06, col07, col08, col09, col10, col11, col12, col13, col14, col15, col16, col17, col18 from t2778;
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/aggregate.out b/java/testing/org/apache/derbyTesting/functionTests/master/aggregate.out
index 40365ac86..5947a76ab 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/aggregate.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/aggregate.out
@@ -233,6 +233,9 @@ WARNING 01003: Null values were eliminated from the argument of a column functio
 ij> -- binary list operator
 select (1 in (1,2)), count(c1) from t1 group by c1;
 ERROR 42X01: Syntax error: Encountered "in" at line 2, column 11.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select count((1 in (1,2))) from t1 group by c1;
 1          
 -----------
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/altertable.out b/java/testing/org/apache/derbyTesting/functionTests/master/altertable.out
index 237feeb90..f86c51e6b 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/altertable.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/altertable.out
@@ -996,6 +996,9 @@ ERROR X0Y32: Column 'B' already exists in Table/View 'RENC_1'.
 ij> -- new column name is a reserved word:
 rename column renc_1.a to select;
 ERROR 42X01: Syntax error: Encountered "select" at line 2, column 27.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- attempt to rename a column in a system table. Should fali:
 rename column sys.sysconglomerates.isindex to is_an_index;
 ERROR 42X62: 'RENAME COLUMN' is not allowed in the 'SYS' schema.
@@ -1029,16 +1032,34 @@ rename column renc_1 to b;
 ERROR 42Y55: 'RENAME COLUMN' cannot be performed on 'RENC_1' because it does not exist.
 ij> rename column renc_1 rename a to b;
 ERROR 42X01: Syntax error: Encountered "rename" at line 1, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> rename column renc_1.a;
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 1, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> rename column renc_1.a b;
 ERROR 42X01: Syntax error: Encountered "b" at line 1, column 24.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> rename column renc_1.a to;
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 1, column 25.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> rename column renc_1.a to b, c;
 ERROR 42X01: Syntax error: Encountered "," at line 1, column 28.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> rename column renc_1.a to b and c to d;
 ERROR 42X01: Syntax error: Encountered "and" at line 1, column 29.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Rename a column which is the primary key of the table:
 create table renc_2(c1 int not null constraint renc_2_p1 primary key);
 0 rows inserted/updated/deleted
@@ -1405,19 +1426,40 @@ ERROR 42X14: 'B' is not a column in table or VTI 'ATDC_2'.
 ij> -- Column name is spelled incorrectly (wrong case)
 alter table atdc_2 drop column 'a';
 ERROR 42X01: Syntax error: Encountered "\'a\'" at line 2, column 32.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Some special reserved words to cause parser errors
 alter table atdc_2 drop column column;
 ERROR 42X01: Syntax error: Encountered "column" at line 2, column 32.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> alter table atdc_2 drop column;
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 1, column 30.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> alter table atdc_2 drop column constraint;
 ERROR 42X01: Syntax error: Encountered "constraint" at line 1, column 32.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> alter table atdc_2 drop column primary;
 ERROR 42X01: Syntax error: Encountered "primary" at line 1, column 32.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> alter table atdc_2 drop column foreign;
 ERROR 42X01: Syntax error: Encountered "foreign" at line 1, column 32.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> alter table atdc_2 drop column check;
 ERROR 42X01: Syntax error: Encountered "check" at line 1, column 32.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table atdc_3 (a integer);
 0 rows inserted/updated/deleted
 ij> create index atdc_3_idx_1 on atdc_3 (a);
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/autoincrement.out b/java/testing/org/apache/derbyTesting/functionTests/master/autoincrement.out
index c4806a731..4c17f2e83 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/autoincrement.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/autoincrement.out
@@ -881,6 +881,9 @@ ij> create table ni (x int, y smallint generated always as identity (start with
 ERROR 42Z21: Invalid increment specified for identity for column 'Y'. Increment cannot be zero.  
 ij> create table ni (x int, y int generated always as identity (increment by 0);
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 1, column 75.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table ni (x int, y int generated always as identity (start with 0, increment by 0));
 ERROR 42Z21: Invalid increment specified for identity for column 'Y'. Increment cannot be zero.  
 ij> create table ni (x int, y bigint generated always as identity (increment by 0));
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/bit.out b/java/testing/org/apache/derbyTesting/functionTests/master/bit.out
index d8307ed38..d630a5ea3 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/bit.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/bit.out
@@ -54,10 +54,19 @@ ij> drop table tab1;
 ij> -- simple negative test
 values(X'gg');
 ERROR 42X01: Syntax error: Encountered "\'gg\'" at line 2, column 9.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values(X'z');
 ERROR 42X01: Syntax error: Encountered "\'z\'" at line 1, column 9.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values(X'zz');
 ERROR 42X01: Syntax error: Encountered "\'zz\'" at line 1, column 9.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- fails after bug 5742 is fixed
 values(X'9');
 ERROR 42606: An invalid hexadecimal constant starting with 'X'9'' has been detected.
@@ -868,4 +877,4 @@ ij> drop table npetest2;
 0 rows inserted/updated/deleted
 ij> drop table npetest1;
 0 rows inserted/updated/deleted
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/cast.out b/java/testing/org/apache/derbyTesting/functionTests/master/cast.out
index bbd9cd457..f16a6dcc4 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/cast.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/cast.out
@@ -1572,8 +1572,14 @@ ij> values CHAR(INTEGER(12345));
 12345      
 ij> values CHAR(DEC(67.21,4,2));
 ERROR 42X01: Syntax error: Encountered "DEC" at line 1, column 13.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CHAR(DECIMAL(67.10,4,2));
 ERROR 42X01: Syntax error: Encountered "DECIMAL" at line 1, column 13.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CHAR(DOUBLE(5.55));
 1                                                    
 -----------------------------------------------------
@@ -1619,6 +1625,9 @@ ij> -- test some casting from a java type to standard SQL types.
 -- should all fail at runtime
 select cast (aliasinfo as BOOLEAN) from sys.sysaliases;
 ERROR 42X01: Syntax error: BOOLEAN.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select cast (aliasinfo as SMALLINT) from sys.sysaliases;
 1     
 ------
@@ -1676,4 +1685,4 @@ ij> select cast (aliasinfo as LONG VARCHAR) from sys.sysaliases where CAST(alias
 1                                                                                                                               
 --------------------------------------------------------------------------------------------------------------------------------
 INSTALL_JAR(IN URL VARCHAR(256),IN JAR VARCHAR(128),IN DEPLOY INTEGER) LANGUAGE JAVA PARAMETER STYLE JAVA MODIFIES SQL DATA     
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/columnDefaults.out b/java/testing/org/apache/derbyTesting/functionTests/master/columnDefaults.out
index d46e7ba59..4ec325507 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/columnDefaults.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/columnDefaults.out
@@ -19,12 +19,21 @@ ij> --
 -- ? in default
 create table neg(c1 int default ?);
 ERROR 42X01: Syntax error: Encountered "?" at line 22, column 33.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- column reference in default
 create table neg(c1 int, c2 int default c1);
 ERROR 42X01: Syntax error: Encountered "c1" at line 2, column 41.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- subquery in default
 create table neg(c1 int default (values 1));
 ERROR 42X01: Syntax error: Encountered "(" at line 2, column 33.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- type incompatibility at compile time
 create table neg(c1 date default 1);
 ERROR 42821: Columns of type 'DATE' cannot hold values of type 'INTEGER'. 
@@ -55,6 +64,9 @@ create table neg(c1 date);
 0 rows inserted/updated/deleted
 ij> alter table neg modify x default null;
 ERROR 42X01: Syntax error: Encountered "modify" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> alter table neg add column x date default 1;
 ERROR 42821: Columns of type 'DATE' cannot hold values of type 'INTEGER'. 
 ij> -- bug 5585 - should fail at alter table statement
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/compressTable.out b/java/testing/org/apache/derbyTesting/functionTests/master/compressTable.out
index b17a389e7..176a1901f 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/compressTable.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/compressTable.out
@@ -940,6 +940,9 @@ insert into xena values (select a + 4, b - 4, c, d from xena);
 ERROR 42X80: VALUES clause must contain at least one element. Empty elements are not allowed. 
 ij> insert into xena values (select (a + 4, b - 4, c, d from xena);
 ERROR 42X01: Syntax error: Encountered "," at line 1, column 39.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select 
      cast (conglomeratename as char(10)) as name, 
      cast (numallocatedpages as char(4)) as aloc, 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/currentSchema.out b/java/testing/org/apache/derbyTesting/functionTests/master/currentSchema.out
index 56ac63f54..7955a69f8 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/currentSchema.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/currentSchema.out
@@ -102,6 +102,9 @@ JUDY
 ij> -- check that set sqlid doesn't work (not DB2 compatible) - should get error
 set sqlid judy;
 ERROR 42X01: Syntax error: Encountered "sqlid" at line 2, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- change schema and make sure that the current schema is correct
 set schema sys;
 0 rows inserted/updated/deleted
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/db2Compatibility.out b/java/testing/org/apache/derbyTesting/functionTests/master/db2Compatibility.out
index fa05e4451..5adbcfaf1 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/db2Compatibility.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/db2Compatibility.out
@@ -74,27 +74,54 @@ ij> -- Simple Cloudscape specific features.
 -- CLASS ALIAS;
 create class alias MyMath for java.lang.Math;
 ERROR 42X01: Syntax error: Encountered "class" at line 5, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop class alias MyMath;
 ERROR 42X01: Syntax error: Encountered "class" at line 1, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create class alias for java.lang.Math;
 ERROR 42X01: Syntax error: Encountered "class" at line 1, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop class alias Math;
 ERROR 42X01: Syntax error: Encountered "class" at line 1, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- METHOD ALIAS;
 create method alias myabs for java.lang.Math.abs;
 ERROR 42X01: Syntax error: Encountered "method" at line 3, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop method alias myabs;
 ERROR 42X01: Syntax error: Encountered "method" at line 1, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- STORED PREPARED STATEMENTS 
 -- create statement no more supported both in db2 and cloudscpae mode. -ve test for that
 create statement s1 as values 1,2;
 ERROR 42X01: Syntax error: Encountered "statement" at line 3, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- alter, drop and execute statements are still supported for existing stored prepared statements for customers
 alter statement recompile all;
 ERROR 42X01: Syntax error: Encountered "statement" at line 2, column 7.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- following will give error because there is no stored prepared statement s1 in the database
 drop statement s1;
 ERROR 42X01: Syntax error: Encountered "statement" at line 2, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- clean up
 DROP TABLE t1;
 ERROR 42Y55: 'DROP TABLE' cannot be performed on 'T1' because it does not exist.
@@ -102,8 +129,14 @@ ij> DROP TABLE t2;
 ERROR 42Y55: 'DROP TABLE' cannot be performed on 'T2' because it does not exist.
 ij> DROP CLASS ALIAS ExternalInsert;
 ERROR 42X01: Syntax error: Encountered "CLASS" at line 1, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> DROP STATEMENT insert1;
 ERROR 42X01: Syntax error: Encountered "STATEMENT" at line 1, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Primary key constraint, DB2 requires NOT null on the columns.
 create table customer (id int primary key, name char(100));
 0 rows inserted/updated/deleted
@@ -118,6 +151,9 @@ create schema fred;
 0 rows inserted/updated/deleted
 ij> drop schema fred;
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop schema fred restrict;
 0 rows inserted/updated/deleted
 ij> -- create schema not supported for schemas that start with SYS
@@ -138,14 +174,29 @@ ij> drop schema "sysok" restrict;
 ij> -- data types not supported
 create table NOTYPE(i int, b BOOLEAN);
 ERROR 42X01: Syntax error: BOOLEAN.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table NOTYPE(i int, b TINYINT);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 30.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table NOTYPE(i int, b java.lang.String);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 30.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table NOTYPE(i int, b com.acme.Address);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 30.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table NOTYPE(i int, b org.apache.derby.vti.VTIEnvironment);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 30.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- VTI in the DELETE statement
 -- beetle 5234
 CREATE TABLE testCS (col1 int, col2 char(30), col3 int);
@@ -154,18 +205,33 @@ ij> INSERT INTO testCS VALUES (100, 'asdf', 732);
 1 row inserted/updated/deleted
 ij> DELETE FROM NEW org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable('jdbc:derby:wombat', 'testCS') WHERE col1 = 100 and col3 = 732;
 ERROR 42X01: Syntax error: org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- VTI in the INSERT statement
 -- beetle 5234
 INSERT INTO NEW org.apache.derbyTesting.functionTests.util.serializabletypes.ExternalTable('jdbc:derby:wombat', 'testCS') VALUES (100, 'asdf', 732);
 ERROR 42X01: Syntax error: org.apache.derbyTesting.functionTests.util.serializabletypes.ExternalTable.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- VTI in the SELECT statement
 -- beetle 5234
 select * from testCS, new org.apache.derbyTesting.functionTests.util.VTIClasses.PositiveInteger_VTICosting_SI(col1, 1) a;
 ERROR 42X01: Syntax error: org.apache.derbyTesting.functionTests.util.VTIClasses.PositiveInteger_VTICosting_SI.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from new com.acme.myVTI() as T;
 ERROR 42X01: Syntax error: com.acme.myVTI.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from new org.apache.derbyTesting.not.myVTI() as T;
 ERROR 42X01: Syntax error: org.apache.derbyTesting.not.myVTI.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from syscs_diag.lock_table;
 XID            |TYPE |MODE|TABLENAME                                                                                                                       |LOCKNAME            |STATE|TABLETYPE|LOCK&|INDEXNAME                                                                                                                       
 ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
@@ -175,14 +241,23 @@ CREATE TABLE tb1(a int);
 0 rows inserted/updated/deleted
 ij> CREATE TRIGGER testtrig1 AFTER DELETE ON tb1 FOR EACH ROW MODE DB2SQL INSERT INTO NEW org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable('jdbc:derby:wombat', 'testCS') VALUES (1000);
 ERROR 42X01: Syntax error: org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- VTI in CREATE TRIGGER statement
 -- beetle 5234
 CREATE TRIGGER testtrig2 AFTER DELETE ON tb1 FOR EACH ROW MODE DB2SQL DELETE FROM NEW org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable('jdbc:derby:wombat', 'testCS') WHERE col1 = 100 and col3 = 732;
 ERROR 42X01: Syntax error: org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- VTI in CREATE TRIGGER statement
 -- beetle 5234
 CREATE TRIGGER testtrig3 AFTER DELETE ON tb1 FOR EACH ROW MODE DB2SQL SELECT * FROM testCS, NEW org.apache.derbyTesting.functionTests.util.VTIClasses.PositiveInteger_VTICosting_SI(col1, 1) a;
 ERROR 42X01: Syntax error: org.apache.derbyTesting.functionTests.util.VTIClasses.PositiveInteger_VTICosting_SI.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- clean up
 DROP TABLE tb1;
 0 rows inserted/updated/deleted
@@ -194,16 +269,28 @@ create table maps2 (country_ISO_code char(2));
 ij> -- BTREE not supported in both Cloudscape and DB2 mode and that is why rather than getting feature not implemented, we will get syntax error in DB2 mode
 create btree index map_idx2 on maps2(country_ISO_code);
 ERROR 42X01: Syntax error: Encountered "btree" at line 2, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create unique btree index map_idx2 on maps2(country_ISO_code);
 ERROR 42X01: Syntax error: Encountered "btree" at line 1, column 15.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop table maps2;
 0 rows inserted/updated/deleted
 ij> -- SET LOCKING clause in DB2 mode
 -- beetle 5208
 create table maps1 (country_ISO_code char(2)) set locking = table;
 ERROR 42X01: Syntax error: Encountered "set" at line 3, column 47.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table maps2 (country_ISO_code char(2)) set locking = row;
 ERROR 42X01: Syntax error: Encountered "set" at line 1, column 47.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop table maps1;
 ERROR 42Y55: 'DROP TABLE' cannot be performed on 'MAPS1' because it does not exist.
 ij> drop table maps2;
@@ -216,8 +303,14 @@ create table tb1 (country_ISO_code char(2));
 0 rows inserted/updated/deleted
 ij> alter table tb1 set locking = table;
 ERROR 42X01: Syntax error: Encountered "set" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> alter table tb1 set locking = row;
 ERROR 42X01: Syntax error: Encountered "set" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Locking syntax 
 -- positive tests
 -- beetle 5201
@@ -240,28 +333,46 @@ ij> INSERT INTO testCS VALUES (100, 'asdf', 732);
 1 row inserted/updated/deleted
 ij> DELETE FROM NEW org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable('jdbc:derby:wombat', 'testCS') WHERE col1 = 100 and col3 = 732;
 ERROR 42X01: Syntax error: org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- VTI in the INSERT statement
 -- beetle 5234
 INSERT INTO NEW org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable('jdbc:derby:wombat', 'testCS') VALUES (100, 'asdf', 732);
 ERROR 42X01: Syntax error: org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- VTI in the SELECT statement
 -- beetle 5234
 select * from testCS, new org.apache.derbyTesting.functionTests.util.VTIClasses.PositiveInteger_VTICosting_SI(col1, 1) a;
 ERROR 42X01: Syntax error: org.apache.derbyTesting.functionTests.util.VTIClasses.PositiveInteger_VTICosting_SI.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- VTI in CREATE TRIGGER statement
 -- beetle 5234
 CREATE TABLE tb1(a int);
 0 rows inserted/updated/deleted
 ij> CREATE TRIGGER testtrig1 AFTER DELETE ON tb1 FOR EACH ROW MODE DB2SQL INSERT INTO NEW org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable('jdbc:derby:wombat', 'testCS') VALUES (1000);
 ERROR 42X01: Syntax error: org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- VTI in CREATE TRIGGER statement
 -- beetle 5234
 CREATE TRIGGER testtrig2 AFTER DELETE ON tb1 FOR EACH ROW MODE DB2SQL DELETE FROM NEW org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable('jdbc:derby:wombat', 'testCS') WHERE col1 = 100 and col3 = 732;
 ERROR 42X01: Syntax error: org.apache.derbyTesting.functionTests.util.VTIClasses.ExternalTable.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- VTI in CREATE TRIGGER statement
 -- beetle 5234
 CREATE TRIGGER testtrig3 AFTER DELETE ON tb1 FOR EACH ROW MODE DB2SQL SELECT * FROM testCS, NEW org.apache.derbyTesting.functionTests.util.VTIClasses.PositiveInteger_VTICosting_SI(col1, 1) a;
 ERROR 42X01: Syntax error: org.apache.derbyTesting.functionTests.util.VTIClasses.PositiveInteger_VTICosting_SI.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- clean up
 DROP TABLE tb1;
 0 rows inserted/updated/deleted
@@ -272,27 +383,51 @@ ij> -- RENAME/DROP COLUMN
 -- beetle 5205
 create table table tt (a int, b int, c int);
 ERROR 42X01: Syntax error: Encountered "table" at line 4, column 14.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- alter table tt drop column b; This is now supported by Derby
 alter table tt rename to ttnew;
 ERROR 42X01: Syntax error: Encountered "rename" at line 2, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> alter table tt rename c to d;
 ERROR 42X01: Syntax error: Encountered "rename" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> rename column tt.c to tt.d;
 ERROR 42X01: Syntax error: Encountered "." at line 1, column 25.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop table tt;
 ERROR 42Y55: 'DROP TABLE' cannot be performed on 'TT' because it does not exist.
 ij> -- CASCADE/RESTRICT on DROP CONSTRAINT
 -- beetle 5204
 ALTER TABLE TT DROP CONSTRAINT ABC CASCADE;
 ERROR 42X01: Syntax error: Encountered "CASCADE" at line 3, column 36.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> ALTER TABLE TT DROP CONSTRAINT ABC2 RESTRICT;
 ERROR 42X01: Syntax error: Encountered "RESTRICT" at line 1, column 37.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- CASCADE/RESTRICT on DROP TABLE
 -- beetle 5206
 DROP TABLE TT CASCADE;
 ERROR 42X01: Syntax error: Encountered "CASCADE" at line 3, column 15.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> DROP TABLE TT RESTRICT;
 ERROR 42X01: Syntax error: Encountered "RESTRICT" at line 1, column 15.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- beetle 5216
 -- there should only be one autoincrement column per table 
 CREATE TABLE T1 (C1 INT GENERATED ALWAYS AS IDENTITY 
@@ -344,6 +479,9 @@ ij> CREATE INDEX TTIDX ON TT(A);
 0 rows inserted/updated/deleted
 ij> ALTER INDEX TTIDX RENAME TTIDXNEW;
 ERROR 42X01: Syntax error: Encountered "INDEX" at line 1, column 7.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- clean up
 drop table tt;
 0 rows inserted/updated/deleted
@@ -351,24 +489,48 @@ ij> -- CREATE and DROP AGGREGATE
 -- beetle 5222
 CREATE AGGREGATE STDEV FOR org.apache.derbyTesting.functionTests.util.aggregates.StandardDeviation;
 ERROR 42X01: Syntax error: Encountered "AGGREGATE" at line 3, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> DROP AGGREGATE STDEV;
 ERROR 42X01: Syntax error: Encountered "AGGREGATE" at line 1, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> CREATE AGGREGATE MAXBUTONE FOR org.apache.derbyTesting.functionTests.util.aggregates.MaxButOneDef;
 ERROR 42X01: Syntax error: Encountered "AGGREGATE" at line 1, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> DROP AGGREGATE MAXBUTONE;
 ERROR 42X01: Syntax error: Encountered "AGGREGATE" at line 1, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- CREATE and DROP CLASS ALIAS
 -- beetle 5222
 create class alias for java.util.Hashtable;
 ERROR 42X01: Syntax error: Encountered "class" at line 3, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop class alias Hashtable;
 ERROR 42X01: Syntax error: Encountered "class" at line 1, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- CREATE and DROP METHOD ALIAS
 -- beetle 5222
 create method alias hashtable for java.lang.Math.sin;
 ERROR 42X01: Syntax error: Encountered "method" at line 3, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop method alias hashtable;
 ERROR 42X01: Syntax error: Encountered "method" at line 1, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- RENAME COLUMN
 -- beetle 5222
 create table TT(col1 int, col2 int);
@@ -388,12 +550,24 @@ REFERENCING OLD as oldtable FOR EACH ROW MODE DB2SQL INSERT INTO tb2 VALUES ('tb
 0 rows inserted/updated/deleted
 ij> SET TRIGGERS FOR tb1 ENABLED;
 ERROR 42X01: Syntax error: Encountered "TRIGGERS" at line 1, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SET TRIGGERS FOR tb1 DISABLED;
 ERROR 42X01: Syntax error: Encountered "TRIGGERS" at line 1, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SET TRIGGERS testtrig2 ENABLED;
 ERROR 42X01: Syntax error: Encountered "TRIGGERS" at line 1, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SET TRIGGERS testtrig2 DISABLED;
 ERROR 42X01: Syntax error: Encountered "TRIGGERS" at line 1, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- clean up
 DROP TRIGGER testtrig1;
 ERROR 42X94: TRIGGER 'TESTTRIG1' does not exist.
@@ -409,41 +583,92 @@ ij> -- INSTANCEOF in where clause of select, delete, update,
 -- beetle 5224
 create table t1 (i int, s smallint, c10 char(10), vc30 varchar(30), b boolean);
 ERROR 42X01: Syntax error: BOOLEAN.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table mm (x org.apache.derbyTesting.functionTests.util.ManyMethods);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 20.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table sc (x org.apache.derbyTesting.functionTests.util.SubClass);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 20.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select i from t1 where i instanceof java.lang.Integer;
 ERROR 42X01: Syntax error: Encountered "instanceof" at line 1, column 26.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select i from t1 where i instanceof java.lang.Number;
 ERROR 42X01: Syntax error: Encountered "instanceof" at line 1, column 26.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select i from t1 where i instanceof java.lang.Object;
 ERROR 42X01: Syntax error: Encountered "instanceof" at line 1, column 26.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select s from t1 where s instanceof java.lang.Integer;
 ERROR 42X01: Syntax error: Encountered "instanceof" at line 1, column 26.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select b from t1 where b instanceof java.lang.Boolean;
 ERROR 42X01: Syntax error: Encountered "instanceof" at line 1, column 26.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select c10 from t1 where c10 instanceof java.lang.String;
 ERROR 42X01: Syntax error: Encountered "instanceof" at line 1, column 30.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select vc30 from t1 where vc30 instanceof java.lang.String;
 ERROR 42X01: Syntax error: Encountered "instanceof" at line 1, column 32.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- following are negative test cases because boolean values disallowed in select clause
 select x instanceof org.apache.derbyTesting.functionTests.util.ManyMethods from mm;
 ERROR 42X01: Syntax error: Encountered "org" at line 2, column 21.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select x instanceof org.apache.derbyTesting.functionTests.util.SubClass from mm;
 ERROR 42X01: Syntax error: Encountered "org" at line 1, column 21.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select x instanceof org.apache.derbyTesting.functionTests.util.SubSubClass from mm;
 ERROR 42X01: Syntax error: Encountered "org" at line 1, column 21.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select (i + i) instanceof java.lang.Integer from t1;
 ERROR 42X01: Syntax error: Encountered "java" at line 1, column 27.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select (i instanceof java.lang.Integer) = true from t1;
 ERROR 42X01: Syntax error: Encountered "instanceof" at line 1, column 11.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> DELETE FROM t1 where i INSTANCEOF 
 org.apache.derbyTesting.functionTests.util.serializabletypes.City;
 ERROR 42X01: Syntax error: Encountered "INSTANCEOF" at line 1, column 24.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> UPDATE t1 SET s = NULL WHERE i INSTANCEOF 
 org.apache.derbyTesting.functionTests.util.serializabletypes.City;
 ERROR 42X01: Syntax error: Encountered "INSTANCEOF" at line 1, column 32.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- clean up
 drop table t1;
 ERROR 42Y55: 'DROP TABLE' cannot be performed on 'T1' because it does not exist.
@@ -455,19 +680,37 @@ ij> -- datatypes
 -- beetle 5233
 create table testtype1(col1 bit);
 ERROR 42X01: Syntax error: Encountered "bit" at line 3, column 29.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table testtype2(col1 bit varying(10));
 ERROR 42X01: Syntax error: Encountered "bit" at line 1, column 29.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> --- boolean datatype already disabled
 create table testtype3(col1 boolean);
 ERROR 42X01: Syntax error: BOOLEAN.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table testtype4(col1 LONG NVARCHAR);
 ERROR 0A000: Feature not implemented: LONG NVARCHAR.
 ij> create table testtype5(col1 LONG VARBINARY);
 ERROR 42X01: Syntax error: Encountered "VARBINARY" at line 1, column 34.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table testtype6(col1 LONG BIT VARYING);
 ERROR 42X01: Syntax error: Encountered "BIT" at line 1, column 34.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table testtype7(col1 LONG BINARY);
 ERROR 42X01: Syntax error: Encountered "BINARY" at line 1, column 34.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table testtype8(col1 NCHAR);
 ERROR 0A000: Feature not implemented: NATIONAL CHAR.
 ij> create table testtype9(col1 NVARCHAR(10));
@@ -475,6 +718,9 @@ ERROR 0A000: Feature not implemented: NATIONAL CHAR VARYING.
 ij> -- tinyint datatype already disabled
 create table testtype10(col1 TINYINT);
 ERROR 42X01: Syntax error: Encountered "" at line 2, column 30.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table testtype11 (a national character large object (1000));
 ERROR 0A000: Feature not implemented: NCLOB.
 ij> -- beetle5426
@@ -485,8 +731,14 @@ ij> create table testtype12 (a national char(100));
 ERROR 0A000: Feature not implemented: NATIONAL CHAR.
 ij> CREATE CLASS ALIAS FOR org.apache.derbyTesting.functionTests.util.serializabletypes.Tour;
 ERROR 42X01: Syntax error: Encountered "CLASS" at line 1, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table testtype13 (a Tour);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 28.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- clean up
 drop table testtype1;
 ERROR 42Y55: 'DROP TABLE' cannot be performed on 'TESTTYPE1' because it does not exist.
@@ -516,6 +768,9 @@ ij> drop table testtype12;
 ERROR 42Y55: 'DROP TABLE' cannot be performed on 'TESTTYPE12' because it does not exist.
 ij> drop class alias Tours;
 ERROR 42X01: Syntax error: Encountered "class" at line 1, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop table testtype13;
 ERROR 42Y55: 'DROP TABLE' cannot be performed on 'TESTTYPE13' because it does not exist.
 ij> -- limit char to 254 and varchar to 32672 columns in db2 mode
@@ -553,6 +808,9 @@ ij> CREATE TABLE testsetconst2 (col1 char(7) NOT NULL, CONSTRAINT fk FOREIGN KEY
 0 rows inserted/updated/deleted
 ij> SET CONSTRAINTS fk DISABLED;
 ERROR 42X01: Syntax error: Encountered "CONSTRAINTS" at line 1, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SELECT STATE FROM SYS.SYSCONSTRAINTS;
 &
 -
@@ -560,6 +818,9 @@ E
 E
 ij> SET CONSTRAINTS fk ENABLED;
 ERROR 42X01: Syntax error: Encountered "CONSTRAINTS" at line 1, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SELECT STATE FROM SYS.SYSCONSTRAINTS;
 &
 -
@@ -567,6 +828,9 @@ E
 E
 ij> SET CONSTRAINTS ALL DISABLED;
 ERROR 42X01: Syntax error: Encountered "CONSTRAINTS" at line 1, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SELECT STATE FROM SYS.SYSCONSTRAINTS;
 &
 -
@@ -574,6 +838,9 @@ E
 E
 ij> SET CONSTRAINTS FOR testsetconst1 ENABLED;
 ERROR 42X01: Syntax error: Encountered "CONSTRAINTS" at line 1, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SELECT STATE FROM SYS.SYSCONSTRAINTS;
 &
 -
@@ -588,6 +855,9 @@ ij> -- CALL statement
 -- beetle 5252
 call org.apache.derby.iapi.db.Factory::getDatabaseOfConnection().dropAllJDBCMetaDataSPSes();
 ERROR 42X01: Syntax error: org.apache.derby.iapi.db.Factory::getDatabaseOfConnection.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Beetle 5203: DB2 restricts what can be used for default clauses, and enforces
 -- constraints on the default clause that Cloudscape does not.
 -- Following should be okay:
@@ -657,8 +927,14 @@ ij> -- Beetle 5203, con't: following should all fail (though they'd pass in Clou
 -- expressions:
 create table deftest1 (vc varchar(30) default java.lang.Integer::toBinaryString(3));
 ERROR 42X01: Syntax error: Encountered "java" at line 3, column 47.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table deftest2 (i int default 3+4);
 ERROR 42X01: Syntax error: Encountered "+" at line 1, column 39.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- floating point assignment to non-float column.
 create table deftest3 (i int default 1.234);
 ERROR 42894: DEFAULT value or IDENTITY attribute value is not valid for column 'I'.
@@ -802,12 +1078,24 @@ ij> insert into t1 values 1;
 1 row inserted/updated/deleted
 ij> SET TRANSACTION ISOLATION LEVEL SERIALIZABLE;
 ERROR 42X01: Syntax error: Encountered "TRANSACTION" at line 1, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SET TRANSACTION ISOLATION LEVEL READ COMMITTED;
 ERROR 42X01: Syntax error: Encountered "TRANSACTION" at line 1, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SET TRANSACTION ISOLATION LEVEL REPEATABLE READ;
 ERROR 42X01: Syntax error: Encountered "TRANSACTION" at line 1, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SET TRANSACTION ISOLATION LEVEL READ UNCOMMITTED;
 ERROR 42X01: Syntax error: Encountered "TRANSACTION" at line 1, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- clean up
 drop table t1;
 0 rows inserted/updated/deleted
@@ -905,40 +1193,82 @@ ij> -- CROSS JOIN not supported in both Cloudscape and DB2 mode and that is why
 -- (1) CROSS JOIN should be disabled in FROM clause of SELECT statement
 SELECT * FROM t1 CROSS JOIN t2;
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 3, column 30.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- (2) USING should be disabled in INNER JOIN of SELECT statement
 SELECT * FROM t1 INNER JOIN t2 USING (col1);
 ERROR 42X01: Syntax error: Encountered "USING" at line 2, column 32.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- (3) USING should be disabled in INNER JOIN of SELECT statement
 SELECT * FROM t1 LEFT OUTER JOIN t2 USING (col1);
 ERROR 42X01: Syntax error: Encountered "USING" at line 2, column 37.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- (4) USING should be disabled in INNER JOIN of SELECT statement
 SELECT * FROM t1 RIGHT OUTER JOIN t2 USING (col1);
 ERROR 42X01: Syntax error: Encountered "USING" at line 2, column 38.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- (5) TRUE and FALSE constants should be disabled in WHERE clause of SELECT statement
 SELECT * FROM t1 INNER JOIN t2 ON t1.col1 = t2.col1 WHERE true;
 ERROR 42X01: Syntax error: true.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SELECT * FROM t1 INNER JOIN t2 ON t1.col1 = t2.col1 WHERE false;
 ERROR 42X01: Syntax error: false.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- (5) TRUE and FALSE constants should be disabled in WHERE clause of DELETE statement
 DELETE FROM t1 where true;
 ERROR 42X01: Syntax error: true.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> DELETE FROM t1 where false;
 ERROR 42X01: Syntax error: false.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- (5) TRUE and FALSE constants should be disabled in WHERE clause of DELETE statement
 UPDATE t2 SET col1 = NULL WHERE true;
 ERROR 42X01: Syntax error: true.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> UPDATE t2 SET col1 = NULL WHERE false;
 ERROR 42X01: Syntax error: false.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- (6) AT ISOLATION clause should be disabled in SELECT statement
 -- AT ISOLATION not supported in both Cloudscape and DB2 mode and that is why rather than getting feature not implemented, we will get syntax error
 SELECT * FROM t1 AT ISOLATION READ UNCOMMITTED;
 ERROR 42X01: Syntax error: Encountered "AT" at line 3, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SELECT * FROM t1 AT ISOLATION READ COMMITTED;
 ERROR 42X01: Syntax error: Encountered "AT" at line 1, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SELECT * FROM t1 AT ISOLATION SERIALIZABLE;
 ERROR 42X01: Syntax error: Encountered "AT" at line 1, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> SELECT * FROM t1 AT ISOLATION REPEATABLE READ;
 ERROR 42X01: Syntax error: Encountered "AT" at line 1, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- clean up
 DROP TABLE t1;
 0 rows inserted/updated/deleted
@@ -947,12 +1277,24 @@ ij> DROP TABLE t2;
 ij> -- DEFAULT CAST not supported in both Cloudscape and DB2 mode and that is why rather than getting feature not implemented, we will get syntax error
 create table testuser(col1 BLOB(3K) default cast(user as blob(3k)));
 ERROR 42X01: Syntax error: Encountered "cast" at line 2, column 45.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table testsessionuser(col1 BLOB(3K) default cast(session_user as blob(3k)));
 ERROR 42X01: Syntax error: Encountered "cast" at line 1, column 52.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table testcurrentuser(col1 BLOB(3K) default cast(current_user as blob(3k)));
 ERROR 42X01: Syntax error: Encountered "cast" at line 1, column 52.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table testschema(col1 BLOB(3K) default cast(current schema as blob(3k)));
 ERROR 42X01: Syntax error: Encountered "cast" at line 1, column 47.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- alter table syntax that should be supported in db2 compat mode
 -- beetle 5267
 create table testmodify (col1 varchar(30), col2 int generated always as identity);
@@ -973,6 +1315,9 @@ create table testaddcol (col1 int);
 0 rows inserted/updated/deleted
 ij> alter table testaddcol add column col2 int add col3 int;
 ERROR 42X01: Syntax error: Encountered "add" at line 1, column 44.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop table testaddcol;
 0 rows inserted/updated/deleted
 ij> -- (2) adding more than one unique, referential, or check constraint 
@@ -989,17 +1334,32 @@ ij> create table testaddconst4 (col1 int not null, col2 int not null, col3 int n
 ij> -- adding more than one unique-constraint 
 alter table testaddconst3 add primary key (col1) add unique (col2);
 ERROR 42X01: Syntax error: Encountered "add" at line 2, column 50.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> alter table testaddconst3 add unique (col3) add unique (col4);
 ERROR 42X01: Syntax error: Encountered "add" at line 1, column 45.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- adding more than one referential-constraint 
 alter table testaddconst3 add foreign key (col1) references testaddconst1(col1) add foreign key (col2) references testaddconst2(col2);
 ERROR 42X01: Syntax error: Encountered "add" at line 2, column 81.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- adding more than one check-constraint 
 alter table testaddconst3 add check (col5 is null) add check (col6 is null);
 ERROR 42X01: Syntax error: Encountered "add" at line 2, column 52.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- adding a primary, unique, foreign key, and  check-constraint 
 alter table testaddconst4 add primary key(col1) add unique(col2) add foreign key (col1) references testaddconst1(col1) add check (col2 is null);
 ERROR 42X01: Syntax error: Encountered "add" at line 2, column 49.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- clean up
 drop table testaddconst1;
 0 rows inserted/updated/deleted
@@ -1027,14 +1387,26 @@ ij> CREATE TABLE testdropconst6 (col1 CHAR(7) CONSTRAINT ck1 CHECK (col1 is null
 ij> -- dropping more than one unique-constraint 
 alter table testdropconst1 drop primary key drop constraint uk1;
 ERROR 42X01: Syntax error: Encountered "drop" at line 2, column 45.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> alter table testdropconst2 drop primary key drop constraint uk2 drop constraint uk3;
 ERROR 42X01: Syntax error: Encountered "drop" at line 1, column 45.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- dropping more than one foreign key constraint
 alter table testdropconst5 drop constraint fk1 drop constraint fk2;
 ERROR 42X01: Syntax error: Encountered "drop" at line 2, column 48.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- dropping more than one check constraint
 alter table testdropconst6 drop constraint ck1 drop constraint ck2;
 ERROR 42X01: Syntax error: Encountered "drop" at line 2, column 48.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> --clean up
 drop table testdropconst1;
 0 rows inserted/updated/deleted
@@ -1056,6 +1428,9 @@ create table testmodify (col1 varchar(30), col2 varchar(30));
 0 rows inserted/updated/deleted
 ij> alter table testmodify alter col1 set data type varchar(60) alter col2 set data type varchar(60);
 ERROR 42X01: Syntax error: Encountered "alter" at line 1, column 61.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- clean up
 drop table testmodify;
 0 rows inserted/updated/deleted
@@ -1155,10 +1530,19 @@ ij> -- beetle 5283
 -- db2 raises ERROR 56098, cloudscape should raise error msg?a
 values cast(B'1' as char(100));
 ERROR 42X01: Syntax error: Encountered "\'1\'" at line 4, column 14.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values cast(B'1' as clob(1M));
 ERROR 42X01: Syntax error: Encountered "\'1\'" at line 1, column 14.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values cast(B'1' as blob(1M));
 ERROR 42X01: Syntax error: Encountered "\'1\'" at line 1, column 14.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values cast(X'11' as char(100));
 ERROR 42846: Cannot convert types 'CHAR () FOR BIT DATA' to 'CHAR'.
 ij> values cast(X'11' as clob(1M));
@@ -1185,16 +1569,31 @@ ij> -- Test removed: DERBY-2147
 -- disable Field Access
 VALUES java.lang.Integer::MAX_VALUE;
 ERROR 42X01: Syntax error: java.lang.Integer::MAX_VALUE.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> VALUES (1)->noSuchField;
 ERROR 42X01: Syntax error: Encountered "->" at line 1, column 11.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- beetle 5299
 -- disable Method Invocations 
 VALUES (1)->toString();
 ERROR 42X01: Syntax error: java.lang.Integer.toString.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> VALUES 1.->toString();
 ERROR 42X01: Syntax error: java.math.BigDecimal.toString.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> VALUES 1..getClass()->toString();
 ERROR 42X01: Syntax error: Encountered "1." at line 1, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table m5299 (i int, s varchar(10));
 0 rows inserted/updated/deleted
 ij> insert into m5299 values(1, 'hello');
@@ -1321,28 +1720,64 @@ ij> drop table roTable;
 ij> -- No support for Java types in CAST statements;
 values CAST (NULL AS CLASS java.lang.Integer);
 ERROR 42X01: Syntax error: Encountered "" at line 3, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CAST (NULL AS CLASS com.acme.SomeClass);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CAST (NULL AS CLASS java.sql.Date);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CAST (NULL AS java.lang.Integer);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CAST (NULL AS com.acme.SomeClass);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CAST (NULL AS java.sql.Date);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CAST (? AS CLASS java.lang.Integer);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 19.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CAST (? AS CLASS com.acme.SomeClass);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 19.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CAST (? AS CLASS java.sql.Date);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 19.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CAST (? AS java.lang.Integer);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 19.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CAST (? AS com.acme.SomeClass);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 19.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values CAST (? AS java.sql.Date);
 ERROR 42X01: Syntax error: Encountered "" at line 1, column 19.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- No support for BIT_LENGTH, OCTET_LENGTH, TRIP and SUBSTRING in DB2 compatibility mode
 values BIT_LENGTH(X'55');
 ERROR 42Y03: 'BIT_LENGTH' is not recognized as a function or procedure.
@@ -1358,6 +1793,9 @@ ij> -- Tests for explicit nulls. Not allowed in DB2, defect 5589
 -- Should fail.
 create table t1 ( i int null);
 ERROR 42X01: Syntax error: Encountered "null" at line 3, column 25.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Should pass.
 create table t1 (i int);
 0 rows inserted/updated/deleted
@@ -1366,6 +1804,9 @@ ij> insert into t1 values null;
 ij> -- Alter table add explict null column should also fail.
 alter table t1 add column j int null;
 ERROR 42X01: Syntax error: Encountered "null" at line 2, column 33.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Should pass
 alter table t1 add column j int;
 0 rows inserted/updated/deleted
@@ -1581,6 +2022,9 @@ ij> insert into t1(i) select * from t2 union all select * from t2;
 ERROR 42802: The number of values assigned is not the same as the number of specified or implied columns.
 ij> insert into t1(i, j) select i, j from t2 union all i from t2;
 ERROR 42X01: Syntax error: Encountered "i" at line 1, column 52.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- positive cases
 insert into t1 select * from t2;
 1 row inserted/updated/deleted
@@ -1626,14 +2070,29 @@ create table t1( i int);
 0 rows inserted/updated/deleted
 ij> select * from t1 where ((1=1) IS TRUE);
 ERROR 42X01: Syntax error: Encountered "TRUE" at line 1, column 34.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from t1 where ((1=1) IS NOT TRUE);
 ERROR 42X01: Syntax error: Encountered "TRUE" at line 1, column 38.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from t1 where ((1=0) IS FALSE);
 ERROR 42X01: Syntax error: Encountered "FALSE" at line 1, column 34.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from t1 where ((1=0) IS NOT FALSE);
 ERROR 42X01: Syntax error: Encountered "FALSE" at line 1, column 38.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from t1 where (null IS UNKNOWN);
 ERROR 42X01: Syntax error: Encountered "null" at line 1, column 25.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop table t1;
 0 rows inserted/updated/deleted
 ij> -- Beetle 5635, 5645 and 5633: Generated column name issues
@@ -1694,8 +2153,14 @@ create table tb1 (country_ISO_code char(2));
 0 rows inserted/updated/deleted
 ij> alter table tb1 compress;
 ERROR 42X01: Syntax error: COMPRESS.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> alter table tb1 compress sequential;
 ERROR 42X01: Syntax error: COMPRESS.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- clean up
 drop table tb1;
 0 rows inserted/updated/deleted
@@ -1722,10 +2187,16 @@ ij> -- SET STATISTICS TIMING ON stmt is cloudscape specific, disabled in db2 mod
 -- Once we have rewritten our functions to not use following sql, SET STATISTICS TIMING can be completely removed from the parser.
 set statistics timing on;
 ERROR 42X01: Syntax error: Encountered "statistics" at line 3, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- SET RUNTIMESTATISTICS ON stmt is cloudscape specific, disabled in db2 mode
 -- Once we have rewritten our functions to not use following sql, SET RUNTIMESTATISTICS can be completely removed from the parser.
 set runtimestatistics on;
 ERROR 42X01: Syntax error: Encountered "runtimestatistics" at line 3, column 5.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- following runtime statistics related sql will fail in db2 mode but will run fine in Cloudscape mode
 create table t1 (c1 int, c2 int);
 0 rows inserted/updated/deleted
@@ -1741,8 +2212,14 @@ ERROR 42Y03: 'RUNTIMESTATISTICS' is not recognized as a function or procedure.
 ij> -- following runtime statistics related sql is not supported anymore and will not run in any mode
 UPDATE STATISTICS FOR TABLE T1;
 ERROR 42X01: Syntax error: Encountered "FOR" at line 2, column 19.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> DROP STATISTICS FOR TABLE T1;
 ERROR 42X01: Syntax error: Encountered "STATISTICS" at line 1, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop table t1;
 0 rows inserted/updated/deleted
 ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/delete.out b/java/testing/org/apache/derbyTesting/functionTests/master/delete.out
index 810802359..31506ae5f 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/delete.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/delete.out
@@ -29,6 +29,9 @@ ij> -- negative tests
 -- table name required for positioned delete and for searched delete
 delete;
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 4, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- populate the table
 insert into t1 values (1);
 1 row inserted/updated/deleted
@@ -311,4 +314,4 @@ drop table bug171_employee;
 0 rows inserted/updated/deleted
 ij> drop table bug171_bonuses;
 0 rows inserted/updated/deleted
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/derived.out b/java/testing/org/apache/derbyTesting/functionTests/master/derived.out
index cb234b1a8..50f8637d3 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/derived.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/derived.out
@@ -95,6 +95,9 @@ ij> -- derived tables
 -- no correlation name
 select * from (select * from s);
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 5, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- # of columns does not match
 select aa from (select * from s) ss (aa);
 ERROR 42X32: The number of columns in the derived column list must match the number of columns in table 'SS'.
@@ -489,4 +492,4 @@ ij> drop table s;
 0 rows inserted/updated/deleted
 ij> drop table t;
 0 rows inserted/updated/deleted
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/dml112.out b/java/testing/org/apache/derbyTesting/functionTests/master/dml112.out
index cdc541676..4ecef4d75 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/dml112.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/dml112.out
@@ -619,35 +619,53 @@ ij> -- PASS:0633 If 1 row is inserted?
      FROM WEIRDPAD
      WHERE LTRIM (RTRIM (NAAM)) = 'KEITH';
 ERROR 42X01: Syntax error: Encountered "," at line 3, column 32.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- PASS:0633 If 1 row selected with value KATE ? 
 
    SELECT LTRIM (SPONSOR, 'X') 
      FROM WEIRDPAD
      WHERE RTRIM (NAAM) = '    KEITH';
 ERROR 42X01: Syntax error: Encountered "," at line 3, column 25.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- PASS:0633 If 1 row selected with value KATEXXXXXX ?
 
    SELECT LTRIM (SPONSOR, 'X') 
      FROM WEIRDPAD
      WHERE RTRIM (SPONSOR, 'X') = 'XXXXKATE';
 ERROR 42X01: Syntax error: Encountered "," at line 3, column 25.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- PASS:0633 If 1 row selected with value KATEXXXXXX ?
 
    SELECT LTRIM (B.NAAM)  FROM WEIRDPAD A,
      WEIRDPAD B WHERE RTRIM (LTRIM (A.NAAM, 'B'),'B')
                     = RTRIM (LTRIM (B.SPONSOR, 'X'),'X');
 ERROR 42X01: Syntax error: Encountered "," at line 4, column 43.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- PASS:0633 If 1 row selected with value KEITH ?
 
    SELECT COUNT(*) FROM WEIRDPAD A,
      WEIRDPAD B WHERE LTRIM (A.SPONSOR, '0')
                     = RTRIM (LTRIM (B.NAAM, ' '), ' ');
 ERROR 42X01: Syntax error: Encountered "," at line 4, column 39.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- PASS:0633 If count = 1?
 
    SELECT RTRIM (NAAM, 'BB')
      FROM WEIRDPAD WHERE NAAM LIKE 'KATE%';
 ERROR 42X01: Syntax error: Encountered "," at line 3, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- PASS:0633 If ERROR, length of trim character must be 1 ?
 
    INSERT INTO WEIRDPAD (NAAM, SPONSOR)
@@ -656,6 +674,9 @@ ij> -- PASS:0633 If ERROR, length of trim character must be 1 ?
      FROM HU.STAFF, HU.PROJ 
      WHERE EMPNAME = 'Alice';
 ERROR 42X01: Syntax error: Encountered "," at line 4, column 42.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- PASS:0633 If 3 rows are inserted?
 
    SELECT COUNT(*) FROM WEIRDPAD;
@@ -668,6 +689,9 @@ ij> -- PASS:0633 If count = 5?
      SET SPONSOR = LTRIM (RTRIM (SPONSOR, 'X'), 'X'),
              NAAM = RTRIM (NAAM, 'B');
 ERROR 42X01: Syntax error: Encountered "," at line 4, column 41.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- PASS:0633 If 5 rows are updated?
 
    SELECT COUNT(*) FROM WEIRDPAD
@@ -680,6 +704,9 @@ ij> -- PASS:0633 If count = 2?
    DELETE FROM WEIRDPAD WHERE
      LTRIM('Kest', 'K') = LTRIM(SPONSOR, 'T');
 ERROR 42X01: Syntax error: Encountered "," at line 4, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- PASS:0633 If 1 row is deleted?
 
    SELECT COUNT(*) FROM WEIRDPAD;
@@ -705,11 +732,17 @@ ij> -- PASS:0633 If 1 row is updated?
    SELECT COUNT(*) FROM WEIRDPAD
      WHERE RTRIM (SPONSOR, PADCHAR) IS NULL;
 ERROR 42X01: Syntax error: Encountered "," at line 4, column 26.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- PASS:0633 If count = 2?
 
    SELECT COUNT(*) FROM WEIRDPAD
      WHERE LTRIM (SPONSOR, PADCHAR) = 'KEITH';
 ERROR 42X01: Syntax error: Encountered "," at line 4, column 26.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- PASS:0633 If count = 1?
 
    COMMIT WORK;
@@ -723,4 +756,4 @@ ij> -- END TEST >>> 0633 <<< END TEST
 
 -- *************************************************////END-OF-MODULE
 ;
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/dropTable.out b/java/testing/org/apache/derbyTesting/functionTests/master/dropTable.out
index 246e0f325..3258ab287 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/dropTable.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/dropTable.out
@@ -354,8 +354,14 @@ drop view vt1;
 ERROR X0Y23: Operation 'DROP VIEW' cannot be performed on object 'VT1' because VIEW 'VVT1' is dependent on that object.
 ij> drop view vt1 restrict;
 ERROR 42X01: Syntax error: Encountered "restrict" at line 1, column 15.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop view vt1 cascade;
 ERROR 42X01: Syntax error: Encountered "cascade" at line 1, column 15.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- 
 -- make sure that indexes are dropped for drop table
 --
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/ejbql.out b/java/testing/org/apache/derbyTesting/functionTests/master/ejbql.out
index 50909f890..01020971b 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/ejbql.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/ejbql.out
@@ -1559,29 +1559,65 @@ ij> -- Real
 -- beetle 5806 - support REAL built-in function
 values{fn abs( REAL( 0)                       )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 4, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn abs( REAL(-0)                       )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn abs( REAL( 1)                       )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn abs( REAL(-1)                       )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn abs( REAL( 1000000.001)             )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn abs( REAL(-1000000.001)             )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn abs( REAL( 3.402E+38)               )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn abs( REAL(-3.402E+38) + 1           )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Error
 values{fn abs( REAL( 3.402E+38 * 2)           )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 2, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn abs(-REAL( NaN)                     )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn abs( REAL( 1.40129846432481707e-45) )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn abs( REAL( 3.40282346638528860e+38) )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Double Precision/Double
 -- Basic
 -- beetle 5803 - support DOUBLE_[PRECISION] built-in function
@@ -1637,16 +1673,34 @@ ij> -- Decimal/Numeric
 -- beetle 5802 - support DEC[IMAL] built-in function
 values{ fn abs(DEC( 0)             )};
 ERROR 42X01: Syntax error: Encountered "DEC" at line 4, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn abs(DEC(-0)             )};
 ERROR 42X01: Syntax error: Encountered "DEC" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn abs(DEC( 1)             )};
 ERROR 42X01: Syntax error: Encountered "DEC" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn abs(DEC(-1)             )};
 ERROR 42X01: Syntax error: Encountered "DEC" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn abs(DEC( 1000000000000) )};
 ERROR 42X01: Syntax error: Encountered "DEC" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn abs(DEC(-1000000000000) )};
 ERROR 42X01: Syntax error: Encountered "DEC" at line 1, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- More generic test
 values{ fn abs( 0-1-.1 ) };
 1              
@@ -3332,17 +3386,35 @@ create table foo( a float );
 0 rows inserted/updated/deleted
 ij> insert into foo values ( sqrt(FLOAT( 1)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values ( sqrt(FLOAT( 2)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values (-sqrt(FLOAT( 3)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values (-sqrt(FLOAT( 4)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values (     (FLOAT(-5)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this insert should fail
 insert into foo values ( sqrt(FLOAT(-3)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 2, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> autocommit off;
 ij> prepare p1 as 'select a from foo';
 ij> prepare p2 as 'insert into foo select a*(-1) from foo';
@@ -3356,18 +3428,36 @@ A
 ----------------------
 ij> insert into foo values ( sqrt(FLOAT( 6)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values (-sqrt(FLOAT( 7)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values (-sqrt(FLOAT( 8)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values ( sqrt(FLOAT( 9)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values (     (FLOAT(10)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- few negative tests
 -- insert should fail
 insert into foo values ( sqrt(FLOAT(-7)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 3, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> prepare p3 as 'select sqrt(a) from foo';
 ij> -- executing p3 should fail
 execute p3;
@@ -3387,19 +3477,40 @@ ij> commit;
 ij> autocommit on;
 ij> insert into foo values ( sqrt(FLOAT( 11)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values (-sqrt(FLOAT( 12)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values (-sqrt(FLOAT( 13)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values (-sqrt(FLOAT( 14)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values (     (FLOAT( 15)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- these 2 inserts should fail
 insert into foo values (-sqrt(FLOAT(-12)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 2, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into foo values ( sqrt(FLOAT(-13)));
 ERROR 42X01: Syntax error: Encountered "FLOAT" at line 1, column 31.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- these should pass
 autocommit off;
 ij> execute p1;
@@ -3489,29 +3600,65 @@ ij> -- Real
 -- beetle 5806 - support REAL built-in function
 values{fn sqrt( REAL( 0)                       )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 4, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn sqrt( REAL(-0)                       )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn sqrt( REAL( 1)                       )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn sqrt( REAL(-1)                       )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn sqrt( REAL( 1000000.001)             )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn sqrt( REAL(-1000000.001)             )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn sqrt( REAL( 3.402E+38)               )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn sqrt( REAL(-3.402E+38) + 1           )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Error
 values{fn sqrt( REAL( 3.402E+38 * 2)           )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 2, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn sqrt(-REAL( NaN)                     )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn sqrt( REAL( 1.40129846432481707e-45) )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn sqrt( REAL( 3.40282346638528860e+38) )};
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Double Precision/Double
 -- Basic
 -- beetle 5803 - support DOUBLE_[PRECISION] built-in function
@@ -3529,14 +3676,23 @@ ij> values{fn  sqrt( DOUBLE( 1)                      )};
 1.0                   
 ij> values{fn -sqrt( DOUBLE(1)                       )};
 ERROR 42X01: Syntax error: Encountered "-" at line 1, column 11.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn  sqrt( DOUBLE( 1000000.001)            )};
 1                     
 ----------------------
 1000.0000005          
 ij> values{fn -sqrt( DOUBLE(1000000.001)             )};
 ERROR 42X01: Syntax error: Encountered "-" at line 1, column 11.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn -sqrt( DOUBLE(1.79769E+308)            )};
 ERROR 42X01: Syntax error: Encountered "-" at line 1, column 11.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{fn  sqrt( DOUBLE( 1.79769E+308) + 1       )};
 1                     
 ----------------------
@@ -3573,6 +3729,9 @@ ij> -- Decimal/Numeric
 -- beetle 5802 - support DEC[IMAL] built-in function
 values{ fn sqrt(DEC('0'))};
 ERROR 42X01: Syntax error: Encountered "DEC" at line 4, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- More generic test
 values{ fn sqrt( 0+1+.1 ) };
 1                     
@@ -3625,25 +3784,49 @@ autocommit off;
 ij> prepare p1 as 'select a from myreal where ? <> 1';
 ij> execute p1 using 'values  sqrt(REAL( 0 ))';
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 14.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> execute p1 using 'values -sqrt(REAL( 20))';
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 14.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> execute p1 using 'values  sqrt(REAL( 20))';
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 14.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this should fail
 execute p1 using 'values  sqrt(REAL(-20))';
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 14.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Prepare Statements, should pass
 -- beetle 5806 - support REAL built-in function
 prepare p2 as 'select a from myreal where ? <> 1';
 ij> execute p2 using 'values {fn sqrt (REAL( 0 ))}';
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> execute p2 using 'values {fn -sqrt(REAL( 20))}';
 ERROR 42X01: Syntax error: Encountered "-" at line 1, column 12.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> execute p2 using 'values {fn sqrt (REAL( 20))}';
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this should fail
 execute p2 using 'values {fn  sqrt(REAL(-20))}';
 ERROR 42X01: Syntax error: Encountered "REAL" at line 1, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> autocommit on;
 ij> -- mod function
 create table modfn(s smallint, i int, b bigint, c char(10), d decimal(6,3), r real, dbl double);
@@ -4417,4 +4600,4 @@ ij> select rtrim(substr(' asdf', 1, 3)) from t1;
 1   
 ----
  as 
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/ejbql_nonSPS.out b/java/testing/org/apache/derbyTesting/functionTests/master/ejbql_nonSPS.out
index db54e7032..859e1f7e9 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/ejbql_nonSPS.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/ejbql_nonSPS.out
@@ -22,43 +22,100 @@ create table absolute( a int );
 0 rows inserted/updated/deleted
 ij> values{ fn abs( NULL ) };
 ERROR 42X01: Syntax error: Encountered "NULL" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn abs( null ) };
 ERROR 42X01: Syntax error: Encountered "null" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn abs( ) };
 ERROR 42X01: Syntax error: Encountered ")" at line 1, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Error
 values{ fn concat( ) };
 ERROR 42X01: Syntax error: Encountered ")" at line 2, column 20.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn concat( 'error0' ) };
 ERROR 42X01: Syntax error: Encountered ")" at line 1, column 29.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values  fn concat( 'syntax', ' error1' );
 ERROR 42X01: Syntax error: Encountered "concat" at line 1, column 12.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn concat { 'syntax', ' error2' }};
 ERROR 42X01: Syntax error: Encountered "{" at line 1, column 19.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn concat( 'syntax', ' error3' });
 ERROR 42X01: Syntax error: Encountered "}" at line 1, column 40.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn concat( fn concat( 'nested', ' not ' ), ' allowed!' ) };
 ERROR 42X01: Syntax error: Encountered "concat" at line 1, column 23.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn concat( values{ fn concat( 'nested', ' not ' ) }, ' allowed!' ) };
 ERROR 42X01: Syntax error: Encountered "values" at line 1, column 20.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn locate( null, null ) };
 ERROR 42X01: Syntax error: Encountered "null" at line 1, column 20.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn locate( null, ''   ) };
 ERROR 42X01: Syntax error: Encountered "null" at line 1, column 20.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn locate( '', null   ) };
 ERROR 42X01: Syntax error: Encountered "null" at line 1, column 24.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn locate( null, null,1) };
 ERROR 42X01: Syntax error: Encountered "null" at line 1, column 20.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn locate( null, ''  ,1) };
 ERROR 42X01: Syntax error: Encountered "null" at line 1, column 20.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn locate( '', null  ,1) };
 ERROR 42X01: Syntax error: Encountered "null" at line 1, column 24.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn sqrt( NULL ) };
 ERROR 42X01: Syntax error: Encountered "NULL" at line 1, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn sqrt( null ) };
 ERROR 42X01: Syntax error: Encountered "null" at line 1, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values{ fn sqrt( ) };
 ERROR 42X01: Syntax error: Encountered ")" at line 1, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Substring tests. Valid only as escaped function
 values substring('asdf', 1);
 ERROR 42X80: VALUES clause must contain at least one element. Empty elements are not allowed. 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/floattypes.out b/java/testing/org/apache/derbyTesting/functionTests/master/floattypes.out
index 7d9b4cafa..7bfe0633b 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/floattypes.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/floattypes.out
@@ -1666,9 +1666,15 @@ ij> drop table tt;
 ij> -- these get errors for invalid precision values:
 create table t1 (d double precision, r real, f float(-10));
 ERROR 42X01: Syntax error: Encountered "-" at line 2, column 54.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> --
 create table t2 (d double precision, r real, f float(-1));
 ERROR 42X01: Syntax error: Encountered "-" at line 2, column 54.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table t3 (d double precision, r real, f float(0));
 ERROR 42X48: Value '0' is not a valid precision for FLOAT.
 ij> create table t4 (d double precision, r real, f float(100));
@@ -2577,4 +2583,4 @@ ij> values cast ('' as DECIMAL(6,2));
 1       
 --------
 ERROR 22018: Invalid character string format for type DECIMAL.
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/functions.out b/java/testing/org/apache/derbyTesting/functionTests/master/functions.out
index 29c2ba90e..8657e3e6e 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/functions.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/functions.out
@@ -395,6 +395,9 @@ MODIFIES SQL DATA
 EXTERNAL NAME 'org.apache.derbyTesting.functionTests.util.ProcedureTest.countRows'
 LANGUAGE JAVA PARAMETER STYLE JAVA;
 ERROR 42X01: Syntax error: MODIFIES SQL DATA.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> CREATE FUNCTION SIGNATURE_BUG_DERBY_258_D(P_VAL INT, P_RADIX INT) RETURNS VARCHAR(20)
 LANGUAGE JAVA PARAMETER STYLE JAVA NO SQL
 EXTERNAL NAME 'java.lang.Integer.toString(int, int)';
@@ -467,4 +470,4 @@ ij> drop table SYSFUN_MATH_TEST;
 0 rows inserted/updated/deleted
 ij> drop function SYSFUN.ACOS;
 ERROR 42X62: 'DROP FUNCTION' is not allowed in the 'SYSFUN' schema.
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/identifier.out b/java/testing/org/apache/derbyTesting/functionTests/master/identifier.out
index 592084111..bc7557548 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/identifier.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/identifier.out
@@ -414,32 +414,59 @@ ij> -- Negative tests
 -- test1
 create table "" (c1 int);
 ERROR 42X01: Syntax error: Encountered "\"" at line 4, column 14.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- test2
 create table t1111 ("" int);
 ERROR 42X01: Syntax error: Encountered "\"" at line 2, column 21.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- test3
 create schema "";
 ERROR 42X01: Syntax error: Encountered "\"" at line 2, column 15.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- identifiers can not start with "_"
 -- test4
 create table _t1(_c1 int);
 ERROR 42X01: Syntax error: Encountered "_" at line 3, column 14.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- test5
 create table t1(_c1 int);
 ERROR 42X01: Syntax error: Encountered "_" at line 2, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- test6
 create view _v1 (c1) as select * from t1;
 ERROR 42X01: Syntax error: Encountered "_" at line 2, column 13.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- test7
 create view v1 (__c1) as select * from t1;
 ERROR 42X01: Syntax error: Encountered "_" at line 2, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- test8
 create index _i1 on t1(c1);
 ERROR 42X01: Syntax error: Encountered "_" at line 2, column 14.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- test9
 create table "_"."_"(c1 int);
 0 rows inserted/updated/deleted
 ij> -- test10
 create table "".""(c1 int);
 ERROR 42X01: Syntax error: Encountered "\"" at line 2, column 14.
-ij> 
\ No newline at end of file
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/iepnegativetests_ES.out b/java/testing/org/apache/derbyTesting/functionTests/master/iepnegativetests_ES.out
index 1ef2ba079..4bc9b4e1f 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/iepnegativetests_ES.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/iepnegativetests_ES.out
@@ -66,6 +66,9 @@ call SYSCS_UTIL.SYSCS_EXPORT_QUERY('select from t1',
                                     'extinout/t1.dat' , null, null, null) ;
 ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: Error de sintaxis: Encountered "from" at line 1, column 8.' al evaluar una expresi EnC:>243< n.
 ERROR 42X01: Error de sintaxis: Encountered "from" at line 1, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> --export query is null 
 call SYSCS_UTIL.SYSCS_EXPORT_QUERY(null,
                                     'extinout/t1.dat' , null, null, null) ;
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/ij2.out b/java/testing/org/apache/derbyTesting/functionTests/master/ij2.out
index 075ae1c7f..4d0311ad6 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/ij2.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/ij2.out
@@ -182,4 +182,15 @@ ij> set connection connection0;
 ij> show connections;
 CONNECTION0* - 	jdbc:derby:wombat
 * = current connection
+ij> -- DERBY-3408: Unknown command error should suggest referring to server docs:
+show schema;
+ERROR 42X01: Syntax error: Encountered "show" at line 2, column 1.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
+ij> xxx;
+ERROR 42X01: Syntax error: Encountered "xxx" at line 1, column 1.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/implicitConversions.out b/java/testing/org/apache/derbyTesting/functionTests/master/implicitConversions.out
index 5b5acce6b..519875f9f 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/implicitConversions.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/implicitConversions.out
@@ -2614,8 +2614,14 @@ ij> values 'a', 1.1;
 ERROR 42X61: Types 'CHAR' and 'DECIMAL' are not UNION compatible.
 ij> values true, 'a';
 ERROR 42X01: Syntax error: true.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values 'a', true;
 ERROR 42X01: Syntax error: true.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values date('1996-09-09'), 'a';
 1         
 ----------
@@ -3899,4 +3905,4 @@ ij> -- clean up
 drop table all1;
 0 rows inserted/updated/deleted
 ij> commit;
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/inbetween.out b/java/testing/org/apache/derbyTesting/functionTests/master/inbetween.out
index 292500150..1757f4e31 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/inbetween.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/inbetween.out
@@ -79,6 +79,9 @@ ERROR 42818: Comparisons between 'INTEGER' and 'DATE' are not supported. Types m
 ij> -- between null and
 select * from t where i between null and i;
 ERROR 42X01: Syntax error: Encountered "null" at line 2, column 33.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- cardinality violation on a subquery
 select * from t where i between i and (select i from s);
 ERROR 21000: Scalar subquery is only allowed to return a single row.
@@ -288,9 +291,15 @@ ij> -- negative tests
 -- empty list
 select i from t where i in ();
 ERROR 42X01: Syntax error: Encountered ")" at line 4, column 29.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- null in list
 select i from t where i in (null);
 ERROR 42X01: Syntax error: Encountered "null" at line 2, column 29.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- cardinality violation from subquery
 select i from t where i in (1, 3, 5, 6, (select i from ss));
 ERROR 21000: Scalar subquery is only allowed to return a single row.
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/innerjoin.out b/java/testing/org/apache/derbyTesting/functionTests/master/innerjoin.out
index 589781056..b5cf670d9 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/innerjoin.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/innerjoin.out
@@ -41,11 +41,20 @@ ij> -- negative tests
 -- no join clause
 select * from t1 join t2;
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 4, column 24.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from t1 inner join t2;
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 1, column 30.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- empty column list
 select * from t1 join t2 using ();
 ERROR 42X01: Syntax error: Encountered "using" at line 2, column 26.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- non-boolean join clause
 select * from t1 join t2 on 1;
 ERROR 42Y12: The ON clause of a JOIN is a 'INTEGER' expression.  It must be a BOOLEAN expression.
@@ -234,4 +243,4 @@ ij> drop table t3;
 0 rows inserted/updated/deleted
 ij> drop table insert_test;
 0 rows inserted/updated/deleted
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/isolationLevels.out b/java/testing/org/apache/derbyTesting/functionTests/master/isolationLevels.out
index d67dba230..282e32f2c 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/isolationLevels.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/isolationLevels.out
@@ -686,6 +686,9 @@ None
 ij> -- unknown isolation level
 select * from t1 with rw;
 ERROR 42X01: Syntax error: Encountered "rw" at line 2, column 23.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- check the db2 isolation levels can be used as identifiers
 create table db2iso(cs int, rr int, ur int, rs int);
 0 rows inserted/updated/deleted
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/j9_13/floattypes.out b/java/testing/org/apache/derbyTesting/functionTests/master/j9_13/floattypes.out
index 03c5bdf06..3a2037f9a 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/j9_13/floattypes.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/j9_13/floattypes.out
@@ -1647,9 +1647,15 @@ ij> drop table tt;
 ij> -- these get errors for invalid precision values:
 create table t1 (d double precision, r real, f float(-10));
 ERROR 42X01: Syntax error: Encountered "-" at line 2, column 54.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> --
 create table t2 (d double precision, r real, f float(-1));
 ERROR 42X01: Syntax error: Encountered "-" at line 2, column 54.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table t3 (d double precision, r real, f float(0));
 ERROR 42X48: Value '0' is not a valid precision for FLOAT.
 ij> create table t4 (d double precision, r real, f float(100));
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/floattypes.out b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/floattypes.out
index 116bb00bf..8c15ed696 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/floattypes.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/floattypes.out
@@ -1647,9 +1647,15 @@ ij> drop table tt;
 ij> -- these get errors for invalid precision values:
 create table t1 (d double precision, r real, f float(-10));
 ERROR 42X01: Syntax error: Encountered "-" at line 2, column 54.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> --
 create table t2 (d double precision, r real, f float(-1));
 ERROR 42X01: Syntax error: Encountered "-" at line 2, column 54.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table t3 (d double precision, r real, f float(0));
 ERROR 42X48: Value '0' is not a valid precision for FLOAT.
 ij> create table t4 (d double precision, r real, f float(100));
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/iepnegativetests_ES.out b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/iepnegativetests_ES.out
index 4f549e80d..81bfdd8c3 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/iepnegativetests_ES.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/iepnegativetests_ES.out
@@ -66,6 +66,9 @@ call SYSCS_UTIL.SYSCS_EXPORT_QUERY('select from t1',
                                     'extinout/t1.dat' , null, null, null) ;
 ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: Error de sintaxis: Encountered "from" at line 1, column 8.' al evaluar una expresi EnC:>243< n.
 ERROR 42X01: Error de sintaxis: Encountered "from" at line 1, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> --export query is null 
 call SYSCS_UTIL.SYSCS_EXPORT_QUERY(null,
                                     'extinout/t1.dat' , null, null, null) ;
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/ij2.out b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/ij2.out
index 1733fd748..32082df0a 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/ij2.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/ij2.out
@@ -182,4 +182,15 @@ ij> set connection connection0;
 ij> show connections;
 CONNECTION0*
 * = current connection
+ij> -- DERBY-3408: Unknown command error should suggest referring to server docs:
+show schema;
+ERROR 42X01: Syntax error: Encountered "show" at line 2, column 1.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
+ij> xxx;
+ERROR 42X01: Syntax error: Encountered "xxx" at line 1, column 1.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/logop.out b/java/testing/org/apache/derbyTesting/functionTests/master/logop.out
index 51502645a..f1ba995d0 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/logop.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/logop.out
@@ -274,15 +274,27 @@ X
 ij> -- following NOTs in select clause won't work because it results in a transient boolean datatype
 select ( not ( (1 = 1) or (2 = 2) ) and (3 = 4) ) from s;
 ERROR 42X01: Syntax error: Encountered "not" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> --
 select ( not ( ( (1 = 1) or (2 = 2) ) and (3 = 4) ) ) from s;
 ERROR 42X01: Syntax error: Encountered "not" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> --
 select ( (1 = 2) and not ( (3 = 3) or (4 = 4) ) ) from s;
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 13.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> --
 select ( not ( (1 = 2) and ( (3 = 3) or (4 = 4) ) ) ) from s;
 ERROR 42X01: Syntax error: Encountered "not" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Ands under ands under ands ...
 select * from s where not (	( ( ((1=1) and (1=1)) and ((1=1) and (1=1)) ) and
 						      ( ((1=1) and (1=1)) and ((1=1) and (1=1)) ) ) and
@@ -385,6 +397,9 @@ X
 ij> -- following nots on nots won't work because they result in transient boolean datatype in the select clause
 select not ( not ( not ((1=2) or (1=1))) or (not ((1=2) or (1=2)) ) ) from s;
 ERROR 42X01: Syntax error: Encountered "not" at line 2, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- negative testing
 -- non boolean where clauses
 select * from s where 1;
@@ -404,4 +419,4 @@ drop table t;
 0 rows inserted/updated/deleted
 ij> drop table s;
 0 rows inserted/updated/deleted
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/messageLocale.out b/java/testing/org/apache/derbyTesting/functionTests/master/messageLocale.out
index 1e12b2355..4ef6672ba 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/messageLocale.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/messageLocale.out
@@ -51,6 +51,9 @@ ij> call checkDatabaseLoc('rr_TT');
 ij> -- expect an error
 create table t1 oops (i int primary key);
 ERROR 42X01: Syntax error: Encountered "oops" at line 2, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- setup for
 create table t2 (i int);
 0 rows inserted/updated/deleted
@@ -76,6 +79,9 @@ ij> -- error (in qq_PP messages);
 -- create table t1 (i longe);
 create table t1 oops (i int primary key);
 ERROR 42X01: Error of syntax: Encountered "oops" at line 3, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- warning (in qq_PP messages);
 -- create table t2 (i java.lang.Object);
 create table t2 (i int);
@@ -97,6 +103,9 @@ connect 'jdbc:derby:enTest;create=true;territory=en_US';
 ij> -- create table t1 (i longe);
 create table t1 oops (i int primary key);
 ERROR 42X01: Syntax error: Encountered "oops" at line 2, column 17.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- create table t2 (i java.lang.Object);
 create table t2 (i int);
 0 rows inserted/updated/deleted
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/modifyColumn.out b/java/testing/org/apache/derbyTesting/functionTests/master/modifyColumn.out
index 41b52daf0..59255e40d 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/modifyColumn.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/modifyColumn.out
@@ -106,6 +106,9 @@ A
 ij> -- this should fail
 alter table t1 modify a null;
 ERROR 42X01: Syntax error: Encountered "modify" at line 2, column 16.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into t1 values(DEFAULT);
 1 row inserted/updated/deleted
 ij> select * from t1;
@@ -220,4 +223,4 @@ ID         |NAME
 4          |NULL                                              
 ij> drop table a;
 0 rows inserted/updated/deleted
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/orderby.out b/java/testing/org/apache/derbyTesting/functionTests/master/orderby.out
index 66f139341..320ee78de 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/orderby.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/orderby.out
@@ -343,13 +343,25 @@ rollback ;
 ij> -- . order without by (error)
 select i, v from obt order i;
 ERROR 42X01: Syntax error: Encountered "i" at line 2, column 28.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select i, v from obt by i;
 ERROR 42X01: Syntax error: Encountered "by" at line 1, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- . show order, by are reserved keywords
 select order from obt;
 ERROR 42X01: Syntax error: Encountered "order" at line 2, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select by from obt;
 ERROR 42X01: Syntax error: Encountered "by" at line 1, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- . order by on column not in query (error)
 select i from obt order by c;
 ERROR 42X04: Column 'C' is either not in any table in the FROM list or appears within a join specification and is outside the scope of the join specification or appears in a HAVING clause and is not in the GROUP BY list. If this is a CREATE or ALTER TABLE  statement then 'C' is not a column in the target table.
@@ -733,10 +745,19 @@ rollback ;
 ij> -- . order by only allowed on cursor spec, not subquerys (error) 
 select v from obt where i in (select i from obt2 order by i);
 ERROR 42X01: Syntax error: Encountered "order" at line 2, column 50.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select v from obt where i = (select i from obt2 order by i);
 ERROR 42X01: Syntax error: Encountered "order" at line 1, column 49.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select v from (select i,v from obt2 order by i);
 ERROR 42X01: Syntax error: Encountered "order" at line 1, column 37.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- rollback should release the prepared statements
 rollback ;
 ij> -- order by allowed on datatypes, 
@@ -1269,6 +1290,9 @@ ij> select s.* from t s order by s.d;
 ERROR 42X04: Column 'S.D' is either not in any table in the FROM list or appears within a join specification and is outside the scope of the join specification or appears in a HAVING clause and is not in the GROUP BY list. If this is a CREATE or ALTER TABLE  statement then 'S.D' is not a column in the target table.
 ij> select *, d from t order by d;
 ERROR 42X01: Syntax error: Encountered "," at line 1, column 9.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select t.*, d from t order by d;
 ERROR 42X04: Column 'D' is either not in any table in the FROM list or appears within a join specification and is outside the scope of the join specification or appears in a HAVING clause and is not in the GROUP BY list. If this is a CREATE or ALTER TABLE  statement then 'D' is not a column in the target table.
 ij> select t.*, d from t order by t.d;
@@ -2210,4 +2234,4 @@ ij> select k as s from d3303 group by i,k order by 2;
 ERROR 42X77: Column position '2' is out of range for the query expression.
 ij> drop table d3303;
 0 rows inserted/updated/deleted
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/outerjoin.out b/java/testing/org/apache/derbyTesting/functionTests/master/outerjoin.out
index b280ee701..9f9185c0f 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/outerjoin.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/outerjoin.out
@@ -57,11 +57,20 @@ ij> -- negative tests
 -- no outer join type
 select * from t1 outer join t2;
 ERROR 42X01: Syntax error: Encountered "outer" at line 4, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- no join clause
 select * from t1 left outer join t2;
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 2, column 35.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from t1 right outer join t2;
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 1, column 36.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- positive tests
 select t1.c1 from t1 left outer join t2 on t1.c1 = t2.c1;
 C1         
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/positionedDelUpd.out b/java/testing/org/apache/derbyTesting/functionTests/master/positionedDelUpd.out
index 4fb5c2676..7667185c2 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/positionedDelUpd.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/positionedDelUpd.out
@@ -46,6 +46,9 @@ ij> -- empty table tests
 -- this should fail with a syntax error
 delete;
 ERROR 42X01: Syntax error: Encountered "<EOF>" at line 5, column 6.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this should succeed
 get cursor c0 as 'select * from t1 for update';
 ij> next c0;
@@ -431,6 +434,9 @@ ij> -- empty table tests
 -- this should fail with a syntax error
 update set c1 = c1;
 ERROR 42X01: Syntax error: Encountered "set" at line 5, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this should succeed
 get cursor c0 as 'select * from t1 for update';
 ij> next c0;
@@ -1182,4 +1188,4 @@ ij> -- clean up
 autocommit on;
 ij> drop table test1;
 0 rows inserted/updated/deleted
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/schemas.out b/java/testing/org/apache/derbyTesting/functionTests/master/schemas.out
index 42aa20f67..bc60f52f8 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/schemas.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/schemas.out
@@ -30,16 +30,28 @@ ij> insert into blah.t values (2);
 ERROR 42Y07: Schema 'BLAH' does not exist
 ij> insert into blah.blah.t values (3);
 ERROR 42X01: Syntax error: Encountered "." at line 1, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into blah.blah.blah.t values (3);
 ERROR 42X01: Syntax error: Encountered "." at line 1, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select "goofy name".t.c  from "goofy name".t;
 ERROR 42Y07: Schema 'goofy name' does not exist
 ij> -- catalog name not supported:
 create table mycat.myschem.s(c int);
 ERROR 42X01: Syntax error: Encountered "." at line 2, column 27.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- name too long:
 create table myworld.mycat.myschem.s(c int);
 ERROR 42X01: Syntax error: Encountered "." at line 2, column 27.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create table myschem.s(c int);
 0 rows inserted/updated/deleted
 ij> insert into s values (1);
@@ -48,8 +60,14 @@ ij> insert into honk.s values (2);
 ERROR 42Y07: Schema 'HONK' does not exist
 ij> insert into honk.blat.s values (3);
 ERROR 42X01: Syntax error: Encountered "." at line 1, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> insert into loud.honk.blat.s values (4);
 ERROR 42X01: Syntax error: Encountered "." at line 1, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- Catalog names in column expressions cause syntax errors.  Rather than
 -- fix this, I am checking it in this way, considering that no client we
 -- know of uses catalogs.
@@ -62,6 +80,9 @@ ERROR 42Y07: Schema 'XYZZY' does not exist
 ij> -- catalog name not supported:
 drop table goodness.gosh.s;
 ERROR 42X01: Syntax error: Encountered "." at line 2, column 25.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- finds s, schema name ignored:
 drop table gosh.s;
 ERROR 42Y07: Schema 'GOSH' does not exist
@@ -516,8 +537,14 @@ ij> drop schema "sys" RESTRICT;
 ij> -- try prepared statements, should fail
 prepare createSchema as 'create schema ?';
 ERROR 42X01: Syntax error: Encountered "?" at line 1, column 15.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> prepare dropSchema as 'drop schema ? RESTRICT';
 ERROR 42X01: Syntax error: Encountered "?" at line 1, column 13.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> --
 -- specific drop schema tests, all should fail
 --
@@ -540,6 +567,9 @@ ij> drop table x.x;
 ij> -- syntax not supported yet (but is in the parser)
 drop schema x cascade;
 ERROR 42X01: Syntax error: Encountered "cascade" at line 2, column 15.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> set schema app;
 0 rows inserted/updated/deleted
 ij> drop schema x restrict;
@@ -744,6 +774,9 @@ a
 from test.s
 order by a;
 ERROR 42X01: Syntax error: Encountered "exists" at line 4, column 9.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- negative tests
 
 -- multiple matches at parent level
@@ -966,4 +999,4 @@ ij> set schema app;
 0 rows inserted/updated/deleted
 ij> drop schema test restrict;
 0 rows inserted/updated/deleted
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/select.out b/java/testing/org/apache/derbyTesting/functionTests/master/select.out
index 856c4dc9c..7ae222836 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/select.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/select.out
@@ -66,6 +66,9 @@ I          |S
 ij> -- select * and constants and columns 
 select *, 10, i from t;
 ERROR 42X01: Syntax error: Encountered "," at line 2, column 9.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- select correlation name dot star
 select b.* from t b;
 I          |S     
@@ -214,4 +217,4 @@ ij> select SYS."S1.T1".d1 from "S1.T1";
 ERROR 42X04: Column 'SYS.S1.T1.D1' is either not in any table in the FROM list or appears within a join specification and is outside the scope of the join specification or appears in a HAVING clause and is not in the GROUP BY list. If this is a CREATE or ALTER TABLE  statement then 'SYS.S1.T1.D1' is not a column in the target table.
 ij> select SYS."S1.T1".d1 from "S1.T1" t1;
 ERROR 42X04: Column 'SYS.S1.T1.D1' is either not in any table in the FROM list or appears within a join specification and is outside the scope of the join specification or appears in a HAVING clause and is not in the GROUP BY list. If this is a CREATE or ALTER TABLE  statement then 'SYS.S1.T1.D1' is not a column in the target table.
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/stringtypes.out b/java/testing/org/apache/derbyTesting/functionTests/master/stringtypes.out
index 960798058..cff416f3b 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/stringtypes.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/stringtypes.out
@@ -419,6 +419,9 @@ ij> create table badtab2 (x varchar(0));
 ERROR 42X44: Invalid length '0' in column specification.
 ij> create table badtab3 (x long varchar(3));
 ERROR 42X01: Syntax error: Encountered "(" at line 1, column 37.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- JDBC escape syntax for string functions
 create table trash(c1 char(10));
 0 rows inserted/updated/deleted
@@ -442,4 +445,4 @@ ij> INSERT INTO LVC VALUES ('4749463837617201db01f70000000900001d00001500141a0a0
 ERROR 54002: A string constant starting with ''4749463837617201db01f70000000900001d00001500141a0a002200002&' is too long.
 ij> drop table lvc;
 0 rows inserted/updated/deleted
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/subquery.out b/java/testing/org/apache/derbyTesting/functionTests/master/subquery.out
index 37fc3f512..a62316034 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/subquery.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/subquery.out
@@ -484,10 +484,19 @@ I          |S     |C                             |VC
 ij> -- select list
 select ( i in (select i from t) ) a from s order by a;
 ERROR 42X01: Syntax error: Encountered "in" at line 2, column 12.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select ( i in (select i from t where 1 = 0) ) a from s order by a;
 ERROR 42X01: Syntax error: Encountered "in" at line 1, column 12.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select ( (i in (select i from t where 1 = 0)) is null ) a from s order by a;
 ERROR 42X01: Syntax error: Encountered "in" at line 1, column 13.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- subquery under an or
 select i from s where i = -1 or i in (select i from t);
 I          
@@ -714,9 +723,15 @@ ij> ----------------------------------
 -- binary list node
 select i in (1,2) from (select i from s) as tmp(i);
 ERROR 42X01: Syntax error: Encountered "in" at line 6, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- conditional expression
 select i = 1 ? 1 : i from (select i from s) as tmp(i);
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- more tests for correlated column resolution
 select * from s where i = (values i);
 I          |S     |C                             |VC                            |B                   
@@ -791,6 +806,9 @@ NULL       |NULL  |NULL                          |NULL
 ij> update u set b = exists (select b from t)
 where vc <> (select vc from s where vc = '1');
 ERROR 42X01: Syntax error: Encountered "exists" at line 1, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from u;
 I          |S     |C                             |VC                            |B                   
 -----------------------------------------------------------------------------------------------------
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/subquery2.out b/java/testing/org/apache/derbyTesting/functionTests/master/subquery2.out
index d88919317..14c325c31 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/subquery2.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/subquery2.out
@@ -81,6 +81,9 @@ I          |S     |C                             |VC
 ij> -- invalid operator
 select * from s where s * ANY (select c from t);
 ERROR 42X01: Syntax error: Encountered "ANY" at line 2, column 27.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- ? in select list of subquery
 select * from s where s = ANY (select ? from s);
 ERROR 42X34: There is a ? parameter in the select list.  This is not allowed.
@@ -990,6 +993,9 @@ ij> -- exists returns a boolean value and hence it can not be used to set a valu
 update u set b = exists (select * from t)
 where vc < ANY (select vc from s);
 ERROR 42X01: Syntax error: Encountered "exists" at line 2, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select * from u;
 I          |S     |C                             |VC                            |B                   
 -----------------------------------------------------------------------------------------------------
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/triggerBeforeTrig.out b/java/testing/org/apache/derbyTesting/functionTests/master/triggerBeforeTrig.out
index ce9dd8971..017270860 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/triggerBeforeTrig.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/triggerBeforeTrig.out
@@ -28,25 +28,55 @@ ij> ------------------------------------
 ------------------------------------
 create trigger tbad NO CASCADE before insert on x for each statement drop table x;
 ERROR 42X01: Syntax error: Encountered "drop" at line 4, column 70.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create trigger tbad NO CASCADE before insert on x for each statement drop index x;
 ERROR 42X01: Syntax error: Encountered "drop" at line 1, column 70.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create trigger tbad NO CASCADE before insert on x for each statement alter table x add column y int;
 ERROR 42X01: Syntax error: Encountered "alter" at line 1, column 70.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create trigger tbad NO CASCADE before insert on x for each statement alter table x add constraint ck2 check(x > 0);
 ERROR 42X01: Syntax error: Encountered "alter" at line 1, column 70.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create trigger tbad NO CASCADE before insert on x for each statement alter table x drop constraint ck;
 ERROR 42X01: Syntax error: Encountered "alter" at line 1, column 70.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create trigger tbad NO CASCADE before insert on x for each statement create index x2 on x (x);
 ERROR 42X01: Syntax error: Encountered "create" at line 1, column 70.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create trigger tbad NO CASCADE before insert on x for each statement create index xunrelated on unrelated(x);
 ERROR 42X01: Syntax error: Encountered "create" at line 1, column 70.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create trigger tbad NO CASCADE before insert on x for each statement drop index xunrelated;
 ERROR 42X01: Syntax error: Encountered "drop" at line 1, column 70.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create trigger tbad NO CASCADE before insert on x for each statement drop trigger tbad;
 ERROR 42X01: Syntax error: Encountered "drop" at line 1, column 70.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create trigger tbad NO CASCADE before insert on x for each statement 
 	create trigger tbad2 NO CASCADE before insert on x for each statement values 1;
 ERROR 42X01: Syntax error: Encountered "create" at line 2, column 9.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create trigger tokv1 NO CASCADE before insert on x for each statement values 1;
 0 rows inserted/updated/deleted
 ij> insert into x values 1;
@@ -62,8 +92,14 @@ ij> ------------------------------------
 ------------------------------------
 create trigger tbad NO CASCADE before insert on x for each statement set isolation to rr;
 ERROR 42X01: Syntax error: Encountered "set" at line 4, column 70.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create trigger tbad NO CASCADE before insert on x for each statement lock table x in share mode;
 ERROR 42X01: Syntax error: Encountered "lock" at line 1, column 70.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> ------------------------------------
 -- DML, cannot perform dml on same
 -- table for before trigger, of for
@@ -80,8 +116,14 @@ ij> -- Following tests moved here from triggerRefClause, since these use BEFORE
 -- syntax
 create trigger t1 NO CASCADE before update on x referencing badtoken as oldtable for each row values 1;
 ERROR 42X01: Syntax error: Encountered "badtoken" at line 3, column 61.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> create trigger t1 NO CASCADE before update on x referencing old as oldrow new for each row values 1;
 ERROR 42X01: Syntax error: Encountered "for" at line 1, column 79.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- dup names
 create trigger t1 NO CASCADE before update on x referencing old as oldrow new as newrow old as oldrow2 
 	for each row values 1;
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/triggerGeneral.out b/java/testing/org/apache/derbyTesting/functionTests/master/triggerGeneral.out
index 0f20bc106..22a8e5f56 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/triggerGeneral.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/triggerGeneral.out
@@ -71,6 +71,9 @@ ERROR 42Y40: 'X' appears multiple times in the UPDATE OF column list for trigger
 ij> -- no params in column list
 create trigger tr NO CASCADE before update of x, ? on x for each row values 1;
 ERROR 42X01: Syntax error: Encountered "?" at line 2, column 50.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- invalid column
 create trigger tr NO CASCADE before update of doesnotexist on x for each row values 1;
 ERROR 42X14: 'DOESNOTEXIST' is not a column in table or VTI 'X'.
@@ -80,9 +83,15 @@ ERROR 42Y62: 'CREATE TRIGGER' is not allowed on '"APP"."V"' because it is a view
 ij> -- error to use table qualifier
 create trigger tr NO CASCADE before update of x.x on x for each row values 1;
 ERROR 42X01: Syntax error: Encountered "." at line 2, column 48.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- error to use schema.table qualifier
 create trigger tr NO CASCADE before update of app.x.x on x for each row values 1;
 ERROR 42X01: Syntax error: Encountered "." at line 2, column 50.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- no params in trigger action
 -- bad
 create trigger tr NO CASCADE before delete on x for each row select * from x where x = ?;
@@ -1115,6 +1124,9 @@ ij(USER1)> create table topt2 (i int);
 ij(USER1)> -- expect error
 create trigger tropt after insert on topt1 for each mode db2sql insert into topt2 values 1;
 ERROR 42X01: Syntax error: Encountered "mode" at line 2, column 53.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij(USER1)> -- ok
 create trigger tropt after insert on topt1 insert into topt2 values 1;
 0 rows inserted/updated/deleted
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/valuesclause.out b/java/testing/org/apache/derbyTesting/functionTests/master/valuesclause.out
index 0a8b36614..689d9f419 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/valuesclause.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/valuesclause.out
@@ -49,6 +49,9 @@ ERROR 42X07: Null is only allowed in a VALUES clause within an INSERT statement.
 ij> -- empty values clause
 values();
 ERROR 42X01: Syntax error: Encountered ")" at line 2, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- positive tests
 
 -- single value
@@ -183,21 +186,39 @@ ij> remove v2;
 ij> -- type precedence tests. tinyint not supported by DB2 Cloudscape
 values (1 = 1.2);
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 11.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values (1.2 = 1);
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 13.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values (1 = cast(1 as bigint));
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 11.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values (1 = cast(1 as smallint));
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 11.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values (cast(1 as bigint) = 1);
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 27.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values (cast(1 as smallint) = 1);
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 29.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- inserts
 create table insert_test1 (c1 int);
 0 rows inserted/updated/deleted
@@ -414,12 +435,21 @@ ij> -- should fail because <TABLE> can appear in front of derived table
 select *
 from  table target;
 ERROR 42X01: Syntax error: Encountered "target" at line 3, column 13.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select *
 from  table (target);
 ERROR 42X01: Syntax error: Encountered ")" at line 2, column 20.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> select *
 from  table (target as q);
 ERROR 42X01: Syntax error: Encountered "as" at line 2, column 21.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> drop table sub;
 0 rows inserted/updated/deleted
 ij> drop table target;
@@ -432,122 +462,239 @@ ij> insert into t1 values 1;
 ij> -- boolean expression IS disallowed in values or select clause
 select nullif(c1, 1) is null from t1;
 ERROR 42X01: Syntax error: Encountered "is" at line 2, column 22.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values 1 is null;
 ERROR 42X01: Syntax error: Encountered "is" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- boolean expression =, >, >=, <, <= disallowed in values or select clause
 values 1 = 1;
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select 1 = 1 from t1;
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values (nullif('abc','a') = 'abc');
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 27.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select (nullif('abc','a') = 'abc') from t1;
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 27.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select c11 = any (select c11 from t1) from t1;
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 12.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values 2 > 1;
 ERROR 42X01: Syntax error: Encountered ">" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select 2 > 1 from t1;
 ERROR 42X01: Syntax error: Encountered ">" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values 2 >= 1;
 ERROR 42X01: Syntax error: Encountered ">=" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select 2 >= 1 from t1;
 ERROR 42X01: Syntax error: Encountered ">=" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values 1 < 2;
 ERROR 42X01: Syntax error: Encountered "<" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select 1 < 2 from t1;
 ERROR 42X01: Syntax error: Encountered "<" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values 1 <= 2;
 ERROR 42X01: Syntax error: Encountered "<=" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select 1 <= 2 from t1;
 ERROR 42X01: Syntax error: Encountered "<=" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values (1>1);
 ERROR 42X01: Syntax error: Encountered ">" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select (c1 < 2) from t1;
 ERROR 42X01: Syntax error: Encountered "<" at line 2, column 12.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values (1 between 2 and 5);
 ERROR 42X01: Syntax error: Encountered "between" at line 2, column 11.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select (c1 between 1 and 3) from t1;
 ERROR 42X01: Syntax error: Encountered "between" at line 2, column 12.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- boolean expression LIKE disallowed in values and select clause
 prepare ll1 as 'values ''asdf'' like ?';
 ERROR 42X01: Syntax error: Encountered "like" at line 1, column 15.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> prepare ll1 as 'select ''asdf'' like ? from t1';
 ERROR 42X01: Syntax error: Encountered "like" at line 1, column 15.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> prepare ll15 as 'values ''%foobar'' like ''Z%foobar'' escape ?';
 ERROR 42X01: Syntax error: Encountered "like" at line 1, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> prepare ll15 as 'select ''%foobar'' like ''Z%foobar'' escape ? from t1';
 ERROR 42X01: Syntax error: Encountered "like" at line 1, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values '%foobar' like '%%foobar' escape '%';
 ERROR 42X01: Syntax error: Encountered "like" at line 2, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select '_foobar' like '__foobar' escape '_' from t1;
 ERROR 42X01: Syntax error: Encountered "like" at line 2, column 18.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> prepare ll4 as 'values org.apache.derbyTesting.functionTests.tests.lang.CharUTF8::getMaxDefinedCharAsString() like ?';
 ERROR 42X01: Syntax error: Encountered "like" at line 1, column 95.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- boolean expression INSTANCEOF disallowed in values and select clause
 values 1 instanceof int;
 ERROR 42X01: Syntax error: Encountered "instanceof" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values 1 instanceof java.lang.Integer between false and true;
 ERROR 42X01: Syntax error: Encountered "instanceof" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- boolean expression EXISTS disallowed in values and select clause
 select exists (values 1) from t1;
 ERROR 42X01: Syntax error: Encountered "exists" at line 2, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> values exists (values 2);
 ERROR 42X80: VALUES clause must contain at least one element. Empty elements are not allowed. 
 ij> -- boolean expression EXISTS diallowed in update set clause too
 update t1 set c11 = exists(values 1);
 ERROR 42X01: Syntax error: Encountered "exists" at line 2, column 21.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- ?: not supported anymore
 values not true ? false : true;
 ERROR 42X80: VALUES clause must contain at least one element. Empty elements are not allowed. 
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select not true ? false : true from t1;
 ERROR 42X01: Syntax error: Encountered "not" at line 2, column 8.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values 1 ? 2 : 3;
 ERROR 42X01: Syntax error: Encountered "?" at line 2, column 10.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select c1 is null ? true : false from t1;
 ERROR 42X01: Syntax error: Encountered "is" at line 2, column 11.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select new java.lang.Integer(c1 is null ? 0 : c1) from t1;
 ERROR 42X01: Syntax error: Encountered "is" at line 2, column 33.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select c1, (c1=1? cast(null as int) : c1) is null from t1;
 ERROR 42X01: Syntax error: Encountered "=" at line 2, column 15.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- try few tests in cloudscape mode for boolean expressions in values or select clause
 -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values new java.lang.String() = '';
 ERROR 42X01: Syntax error: java.lang.String.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 values new java.lang.String('asdf') = 'asdf';
 ERROR 42X01: Syntax error: java.lang.String.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select new java.lang.String() = '' from t1;
 ERROR 42X01: Syntax error: java.lang.String.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- this test runs in SPS mode too, hence adding a comment line before the sql, so we get correct column number in error message in both SPS and non-SPS mode
 select new java.lang.String('asdf') = 'asdf' from t1;
 ERROR 42X01: Syntax error: java.lang.String.
+Issue the 'help' command for general information on IJ command syntax.
+Any unrecognized commands are treated as potential SQL commands and executed directly.
+Consult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 ij> -- DERBY-1587
 VALUES INTEGER(1.5);
 1          
@@ -580,4 +727,4 @@ select * from t3 group by i having (values null);
 ERROR 42X07: Null is only allowed in a VALUES clause within an INSERT statement.
 ij> drop table t3;
 0 rows inserted/updated/deleted
-ij> 
\ No newline at end of file
+ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/tests/tools/ij2.sql b/java/testing/org/apache/derbyTesting/functionTests/tests/tools/ij2.sql
index 9a8e53777..03d7df442 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/tests/tools/ij2.sql
+++ b/java/testing/org/apache/derbyTesting/functionTests/tests/tools/ij2.sql
@@ -126,4 +126,8 @@ set connection connection0;
 
 show connections;
 
+-- DERBY-3408: Unknown command error should suggest referring to server docs:
+show schema;
+xxx;
+
 
diff --git a/java/tools/org/apache/derby/impl/tools/ij/utilMain.java b/java/tools/org/apache/derby/impl/tools/ij/utilMain.java
index 9921592ee..62c276ccc 100644
--- a/java/tools/org/apache/derby/impl/tools/ij/utilMain.java
+++ b/java/tools/org/apache/derby/impl/tools/ij/utilMain.java
@@ -554,8 +554,12 @@ public class utilMain implements java.security.PrivilegedAction {
 			errorCode = "";
 		}
 
+		boolean syntaxErrorOccurred = false;
 		for (; e!=null; e=e.getNextException())
 		{
+			sqlState = e.getSQLState();
+			if ("42X01".equals(sqlState))
+				syntaxErrorOccurred = true;
 			/*
 			** If we are to throw errors, then throw the exceptions
 			** that aren't in the ignoreErrors list.  If
@@ -564,7 +568,6 @@ public class utilMain implements java.security.PrivilegedAction {
 			*/
 		 	if (ignoreErrors != null) 
 			{
-				sqlState = e.getSQLState();
 				if ((sqlState != null) &&
 					(ignoreErrors.get(sqlState) != null))
 				{
@@ -585,6 +588,8 @@ public class utilMain implements java.security.PrivilegedAction {
 		{
 			throw new ijFatalException(fatalException);
 		}
+		if (syntaxErrorOccurred)
+			out.println(langUtil.getTextMessage("IJ_SuggestHelp"));
 	}
 
 	/**
diff --git a/java/tools/org/apache/derby/loc/toolsmessages.properties b/java/tools/org/apache/derby/loc/toolsmessages.properties
index 1b5a039c1..5f2109200 100644
--- a/java/tools/org/apache/derby/loc/toolsmessages.properties
+++ b/java/tools/org/apache/derby/loc/toolsmessages.properties
@@ -185,6 +185,7 @@ IJ_XANoI=EmbeddedXADataSource cannot be instantiated, please put derby.jar file
 IJ_EncoAtLineColu=Encountered "{0}" at line {1}, column {2}
 # From TokenMgrError.java
 IJ_LexiErroAtLine0Colu1=Lexical error at line {0}, column {1}.  Encountered: {2}after :"{3}"
+IJ_SuggestHelp=Issue the 'help' command for general information on IJ command syntax.\nAny unrecognized commands are treated as potential SQL commands and executed directly.\nConsult your DBMS server reference documentation for details of the SQL syntax supported by your server.
 TL_incorCase=Case of the Derby attribute is incorrect.
 TL_unknownAtt=Attribute is unknown to Derby.
 TL_trueFalse=Value should be set to true/false.
