diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/j9_13/floattypes.out b/java/testing/org/apache/derbyTesting/functionTests/master/j9_13/floattypes.out
index 691819bc6..281d407e9 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/j9_13/floattypes.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/j9_13/floattypes.out
@@ -50,13 +50,13 @@ ij> values cast (1 as dec(5));
 ------
 1     
 ij> values cast (1.1 as dec(5,3));
-1       
---------
-1.100   
+1      
+-------
+1.100  
 ij> values cast (1.1 as numeric(5,3));
-1       
---------
-1.100   
+1      
+-------
+1.100  
 ij> -- cast to all valid types
 values cast (1.1 as int);
 1          
@@ -393,15 +393,15 @@ ij> select cast(d as double precision) from tmp;
 1.0                   
 1.0                   
 ij> select cast(d as dec(10,2)) from tmp;
-1            
--------------
-1.00         
-1.00         
+1           
+------------
+1.00        
+1.00        
 ij> select cast(d as dec(10,8)) from tmp;
-1            
--------------
-1.00000000   
-1.00000000   
+1           
+------------
+1.00000000  
+1.00000000  
 ij> drop table tmp;
 0 rows inserted/updated/deleted
 ij> drop table t;
@@ -440,12 +440,12 @@ ij> insert into t values (0,		-- int
 						 );
 1 row inserted/updated/deleted
 ij> select dc from t;
-DC           
--------------
-NULL         
-10.00        
--10.00       
-0.00         
+DC          
+------------
+NULL        
+10.00       
+-10.00      
+0.00        
 ij> select dc + i, dc + s, dc + r, dc + dc from t;
 1               |2             |3            |4             
 ------------------------------------------------------------
@@ -484,11 +484,11 @@ NULL                  |NULL
 0.0                   |0.0                   
 ij> -- test null/null, constant/null, null/constant
 select dc, i / dc, 10 / dc, dc / 10e0 from t;
-DC           |2                                 |3                                 |4                     
-----------------------------------------------------------------------------------------------------------
-NULL         |NULL                              |NULL                              |NULL                  
-10.00        |1.0000000000000000000             |1.0000000000000000000             |1.0                   
--10.00       |1.0000000000000000000             |-1.0000000000000000000            |-1.0                  
+DC          |2                                 |3                                 |4                     
+---------------------------------------------------------------------------------------------------------
+NULL        |NULL                              |NULL                              |NULL                  
+10.00       |1.0000000000000000000             |1.0000000000000000000             |1.0                   
+-10.00      |1.0000000000000000000             |-1.0000000000000000000            |-1.0                  
 ERROR 22012: Attempt to divide by zero.
 ij> -- test for divide by 0
 select dc / i from t;
@@ -507,20 +507,20 @@ ij> select 20e0 / 5e0 / 4e0, 20e0 / 4e0 / 5 from t;
 1.0                   |1.0                   
 ij> -- test positive/negative, negative/positive and negative/negative
 select dc, dc / -dc, (-dc) / dc, (-dc) / -dc from t;
-DC           |2                                 |3                                 |4                                 
-----------------------------------------------------------------------------------------------------------------------
-NULL         |NULL                              |NULL                              |NULL                              
-10.00        |-1.000000000000000000000          |-1.000000000000000000000          |1.000000000000000000000           
--10.00       |-1.000000000000000000000          |-1.000000000000000000000          |1.000000000000000000000           
+DC          |2                                 |3                                 |4                                 
+---------------------------------------------------------------------------------------------------------------------
+NULL        |NULL                              |NULL                              |NULL                              
+10.00       |-1.000000000000000000000          |-1.000000000000000000000          |1.000000000000000000000           
+-10.00      |-1.000000000000000000000          |-1.000000000000000000000          |1.000000000000000000000           
 ERROR 22012: Attempt to divide by zero.
 ij> -- test some "more complex" expressions
 select dc, dc + 10e0, dc - (10 - 20e0), dc - 10, dc - (20 - 10) from t;
-DC           |2                     |3                     |4               |5               
----------------------------------------------------------------------------------------------
-NULL         |NULL                  |NULL                  |NULL            |NULL            
-10.00        |20.0                  |20.0                  |0.00            |0.00            
--10.00       |0.0                   |0.0                   |-20.00          |-20.00          
-0.00         |10.0                  |10.0                  |-10.00          |-10.00          
+DC          |2                     |3                     |4               |5               
+--------------------------------------------------------------------------------------------
+NULL        |NULL                  |NULL                  |NULL            |NULL            
+10.00       |20.0                  |20.0                  |0.00            |0.00            
+-10.00      |0.0                   |0.0                   |-20.00          |-20.00          
+0.00        |10.0                  |10.0                  |-10.00          |-10.00          
 ij> -- make sure we get the right scale/precision during arithmetic
 values (9.0 + 9.0);
 1     
@@ -621,9 +621,9 @@ ij> --try a tiny number
 --		 cast(1.7e308 as dec(2147483647))));
 --
 values cast(1 as dec(31, 20));
-1                                 
-----------------------------------
-1.00000000000000000000            
+1                                
+---------------------------------
+1.00000000000000000000           
 ij> -- test the arithmetic operators on a type we know they don't work on
 create table w (x dec, y long varchar);
 0 rows inserted/updated/deleted
@@ -651,314 +651,314 @@ insert into t values (123,			-- int
 1 row inserted/updated/deleted
 ij> -- test =
 select dc from t where dc is null;
-DC           
--------------
-NULL         
+DC          
+------------
+NULL        
 ij> select dc from t where dc = 10;
-DC           
--------------
-10.00        
+DC          
+------------
+10.00       
 ij> select dc from t where dc = -10;
-DC           
--------------
--10.00       
+DC          
+------------
+-10.00      
 ij> select dc from t where dc = 0;
-DC           
--------------
-0.00         
+DC          
+------------
+0.00        
 ij> select dc from t where dc = 1234.45;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc = i;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc = l;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc = s;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc = r;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc = d;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc = dc;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> -- test >
 select dc from t where dc > 10;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc > -10;
-DC           
--------------
-10.00        
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+0.00        
+1234.56     
 ij> select dc from t where dc > 0;
-DC           
--------------
-10.00        
-1234.56      
+DC          
+------------
+10.00       
+1234.56     
 ij> select dc from t where dc > 1234.45;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc > i;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc > l;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc > s;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc > r;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc > d;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc > dc;
-DC           
--------------
+DC          
+------------
 ij> -- test >=
 select dc from t where dc >= 10;
-DC           
--------------
-10.00        
-1234.56      
+DC          
+------------
+10.00       
+1234.56     
 ij> select dc from t where dc >= -10;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc >= 0;
-DC           
--------------
-10.00        
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+0.00        
+1234.56     
 ij> select dc from t where dc >= 1234.45;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc >= i;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc >= l;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc >= s;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc >= r;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc >= d;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc >= dc;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> -- test <
 select dc from t where dc < 10;
-DC           
--------------
--10.00       
-0.00         
+DC          
+------------
+-10.00      
+0.00        
 ij> select dc from t where dc < -10;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc < 0;
-DC           
--------------
--10.00       
+DC          
+------------
+-10.00      
 ij> select dc from t where dc < 1234.45;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc < i;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc < l;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc < s;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc < r;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc < d;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc < dc;
-DC           
--------------
+DC          
+------------
 ij> -- test <=
 select dc from t where dc <= 10;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc <= -10;
-DC           
--------------
--10.00       
+DC          
+------------
+-10.00      
 ij> select dc from t where dc <= 0;
-DC           
--------------
--10.00       
-0.00         
+DC          
+------------
+-10.00      
+0.00        
 ij> select dc from t where dc <= 1234.45;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc <= i;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc <= l;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc <= s;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc <= r;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc <= d;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc <= dc;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> -- test <>
 select dc from t where dc <> 10;
-DC           
--------------
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc <> -10;
-DC           
--------------
-10.00        
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+0.00        
+1234.56     
 ij> select dc from t where dc <> 0;
-DC           
--------------
-10.00        
--10.00       
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+1234.56     
 ij> select dc from t where dc <> 1234.45;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc <> i;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc <> l;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc <> s;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc <> r;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc <> d;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc <> dc;
-DC           
--------------
+DC          
+------------
 ij> --
 -- test a variety of inserts and updates
 --
@@ -982,65 +982,65 @@ ij> -- now do updates and confirm they are ok
 update t2 set dc = dc + 1.1;
 5 rows inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
--8.90        
-1.10         
-11.10        
-1235.66      
-NULL         
+DC          
+------------
+-8.90       
+1.10        
+11.10       
+1235.66     
+NULL        
 ij> update t2 set dc = dc - 1.1;
 5 rows inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
--10.00       
-0.00         
-10.00        
-1234.56      
-NULL         
+DC          
+------------
+-10.00      
+0.00        
+10.00       
+1234.56     
+NULL        
 ij> update t2 set dc = dc / 1.1;
 5 rows inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
--9.09        
-0.00         
-9.09         
-1122.32      
-NULL         
+DC          
+------------
+-9.09       
+0.00        
+9.09        
+1122.32     
+NULL        
 ij> update t2 set dc = dc * 1.1;
 5 rows inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
--9.99        
-0.00         
-9.99         
-1234.55      
-NULL         
+DC          
+------------
+-9.99       
+0.00        
+9.99        
+1234.55     
+NULL        
 ij> -- try some deletes
 delete from t2 where dc > 0;
 2 rows inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
--9.99        
-0.00         
-NULL         
+DC          
+------------
+-9.99       
+0.00        
+NULL        
 ij> delete from t2 where dc = 0;
 1 row inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
--9.99        
-NULL         
+DC          
+------------
+-9.99       
+NULL        
 ij> delete from t2 where dc < 0;
 1 row inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
-NULL         
+DC          
+------------
+NULL        
 ij> drop table t2;
 0 rows inserted/updated/deleted
 ij> drop table t;
@@ -1074,33 +1074,33 @@ ij> insert into t values ('a', 99999999999999.123, 'Z');
 ij> insert into t values ('a', 9.123, 'Z');
 1 row inserted/updated/deleted
 ij> select * from t;
-C1  |D                      |C2  
----------------------------------
-a   |1.1230                 |Z   
-a   |11111.1230             |Z   
-a   |11111111.1230          |Z   
-a   |6.1230                 |Z   
-a   |666.1230               |Z   
-a   |0.6000                 |Z   
-a   |0.0000                 |Z   
-a   |666666.1230            |Z   
-a   |99999999999999.1230    |Z   
-a   |9.1230                 |Z   
+C1  |D                     |C2  
+--------------------------------
+a   |1.1230                |Z   
+a   |11111.1230            |Z   
+a   |11111111.1230         |Z   
+a   |6.1230                |Z   
+a   |666.1230              |Z   
+a   |0.6000                |Z   
+a   |0.0000                |Z   
+a   |666666.1230           |Z   
+a   |99999999999999.1230   |Z   
+a   |9.1230                |Z   
 ij> update t set d = d + .0007;
 10 rows inserted/updated/deleted
 ij> select * from t;
-C1  |D                      |C2  
----------------------------------
-a   |1.1237                 |Z   
-a   |11111.1237             |Z   
-a   |11111111.1237          |Z   
-a   |6.1237                 |Z   
-a   |666.1237               |Z   
-a   |0.6007                 |Z   
-a   |0.0007                 |Z   
-a   |666666.1237            |Z   
-a   |99999999999999.1237    |Z   
-a   |9.1237                 |Z   
+C1  |D                     |C2  
+--------------------------------
+a   |1.1237                |Z   
+a   |11111.1237            |Z   
+a   |11111111.1237         |Z   
+a   |6.1237                |Z   
+a   |666.1237              |Z   
+a   |0.6007                |Z   
+a   |0.0007                |Z   
+a   |666666.1237           |Z   
+a   |99999999999999.1237   |Z   
+a   |9.1237                |Z   
 ij> drop table tmp;
 ERROR 42Y55: 'DROP TABLE' cannot be performed on 'TMP' because it does not exist.
 ij> drop table bad;
@@ -2444,87 +2444,87 @@ ij> insert into tiger values (0.00000001234);
 ij> insert into tiger values (0.00000001234);
 1 row inserted/updated/deleted
 ij> select d from tiger order by 1;
-D              
----------------
-0.00000001234  
-0.00000001234  
-0.00000012340  
-0.00000123400  
-0.00001234000  
-0.00012340000  
-0.00123400000  
-0.00123400000  
-0.01234000000  
-0.12340000000  
-1.23400000000  
+D             
+--------------
+0.00000001234 
+0.00000001234 
+0.00000012340 
+0.00000123400 
+0.00001234000 
+0.00012340000 
+0.00123400000 
+0.00123400000 
+0.01234000000 
+0.12340000000 
+1.23400000000 
 ij> -- =====================================================
 -- some formatting tests
 values cast ('1e+0' as DECIMAL(6,2));
-1        
----------
-ERROR 22018: Invalid character string format for type DECIMAL.
+1       
+--------
+1.00    
 ij> values cast ('+-1e+1' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('-1e+1' as DECIMAL(6,2));
-1        
----------
-ERROR 22018: Invalid character string format for type DECIMAL.
+1       
+--------
+-10.00  
 ij> values cast ('-1e-1' as DECIMAL(6,2));
-1        
----------
--0.10    
+1       
+--------
+-0.10   
 ij> values cast ('-1e-+1' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('-1e--1' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('-1e+-1' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('-1e+-1' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('1.0e' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('1.0e+' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('1.0e-' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('1.0ee' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('123.' as DECIMAL(6,2));
-1        
----------
-123.00   
+1       
+--------
+123.00  
 ij> values cast ('1e' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('1e1.0' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('.3' as DECIMAL(6,2));
-1        
----------
-0.30     
+1       
+--------
+0.30    
 ij> values cast ('' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/autoGeneratedJdbc30.out b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/autoGeneratedJdbc30.out
index 1f58ffebc..02d0c53e0 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/autoGeneratedJdbc30.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/autoGeneratedJdbc30.out
@@ -12,88 +12,88 @@ Test 3 - insert multiple rows into a table with autogenerated key and request ge
  there was no prior one-row insert into a table with autogenerated key
 	 1
 	 -
-	{3}
+	{null}
 Now try the same test again but this time with Statement.executeUpdate. It should behave the same
 	 1
 	 -
-	{6}
+	{null}
 Now try the same test again but this time with PreparedStatement.execute. It should behave the same
 	 1
 	 -
-	{9}
+	{null}
 Now try the same test again but this time with PreparedStatement.executeUpdate. It should behave the same
 	 1
 	 -
-	{12}
+	{null}
 Test 4 - request for generated keys after doing an insert into a table with no auto generated keys
  And there has been no one-row insert into a table with auto-generated keys yet.
 We should get a resultset with one row of NULL value from getGeneratedKeys
 	 1
 	 -
-	{12}
+	{null}
 Now try the same test again but this time with Statement.executeUpdate. It should behave the same
 	 1
 	 -
-	{12}
+	{null}
 Now try the same test again but this time with PreparedStatement.execute. It should behave the same
 	 1
 	 -
-	{12}
+	{null}
 Now try the same test again but this time with PreparedStatement.executeUpdate. It should behave the same
 	 1
 	 -
-	{12}
+	{null}
 Test 5a - request for generated keys after doing a one-row insert(using a subquery) into a table with autogenerated key using a subquery with auto generated keys
 Even though this is a one-row insert but since insert has a sub-select, get generated keys will return one row of NULL value
 	 1
 	 -
-	{6}
+	{null}
 Now try the same test again but this time with Statement.executeUpdate. It should behave the same
 	 1
 	 -
-	{12}
+	{null}
 Now try the same test again but this time with PreparedStatement.execute. It should behave the same
 	 1
 	 -
-	{18}
+	{null}
 Now try the same test again but this time with PreparedStatement.executeUpdate. It should behave the same
 	 1
 	 -
-	{24}
+	{null}
 Test 5b - request for generated keys after doing a one-row insert(using a subquery) into a table with autogenerated key using a subquery with auto generated keys
 Even though this is a one-row insert but since insert has a sub-select, get generated keys will return one row of NULL value
 	 1
 	 -
-	{0}
+	{null}
 Now try the same test again but this time with Statement.executeUpdate. It should behave the same
 	 1
 	 -
-	{0}
+	{null}
 Now try the same test again but this time with PreparedStatement.execute. It should behave the same
 	 1
 	 -
-	{0}
+	{null}
 Now try the same test again but this time with PreparedStatement.executeUpdate. It should behave the same
 	 1
 	 -
-	{0}
+	{null}
 Test 5c - request for generated keys after doing a one-row insert(using a subquery) into a table with autogenerated key using a subquery with auto generated keys
 Even though this is a one-row insert but since insert has a sub-select, get generated keys will return one row of NULL value
 	 1
 	 -
-	{25}
+	{null}
 Now try the same test again but this time with Statement.executeUpdate. It should behave the same
 	 1
 	 -
-	{26}
+	{null}
 Now try the same test again but this time with PreparedStatement.execute. It should behave the same
 	 1
 	 -
-	{27}
+	{null}
 Now try the same test again but this time with PreparedStatement.executeUpdate. It should behave the same
 	 1
 	 -
-	{28}
+	{null}
 Test 6 - request for generated keys after doing a one-row insert into a table with auto generated keys
 We should get a resultset with one row of non-NULL value
 	 1
@@ -115,37 +115,37 @@ Test 7 - Now try again inserting multiple rows into a table with autogenerated k
  This time we will get a row of non-NULL value because there has been a prior one-row insert into table with auto-generated key 
 	 1
 	 -
-	{15}
+	{32}
 Now try the same test again but this time with Statement.executeUpdate. It should behave the same
 	 1
 	 -
-	{18}
+	{32}
 Now try the same test again but this time with PreparedStatement.execute. It should behave the same
 	 1
 	 -
-	{21}
+	{32}
 Now try the same test again but this time with PreparedStatement.executeUpdate. It should behave the same
 	 1
 	 -
-	{24}
+	{32}
 Test 8 - create a new statement and request for generated keys on it after doing an insert into 
  a table with no auto generated keys
 We should get a resultset with one row of non-NULL value
 	 1
 	 -
-	{24}
+	{32}
 Now try the same test again but this time with Statement.executeUpdate. It should behave the same
 	 1
 	 -
-	{24}
+	{32}
 Now try the same test again but this time with PreparedStatement.execute. It should behave the same
 	 1
 	 -
-	{24}
+	{32}
 Now try the same test again but this time with PreparedStatement.executeUpdate. It should behave the same
 	 1
 	 -
-	{24}
+	{32}
 Test 9 - request for generated keys on a statement which does a update 
 We should get a resultset with no rows from getGeneratedKeys because we executed a non-insert sql
 <NULL>
@@ -169,37 +169,37 @@ Test 11 - do a commit and request for generated keys on a statement which does i
 expected to see resultset with one row of NULL value but instead get one row of non-NULL value from getGeneratedKeys
 	 1
 	 -
-	{24}
+	{32}
 Now try the same test again but this time with Statement.executeUpdate. It should behave the same
 	 1
 	 -
-	{24}
+	{32}
 Now try the same test again but this time with PreparedStatement.execute. It should behave the same
 	 1
 	 -
-	{24}
+	{32}
 Now try the same test again but this time with PreparedStatement.executeUpdate. It should behave the same
 	 1
 	 -
-	{24}
+	{32}
 Test 12 - do a rollback and request for generated keys on a statement which does insert into a table with 
  no auto generated keys (previous transaction had a one-row insert on a table with auto-generated keys)
 had expected to see resultset with one row of NULL value but instead get one row of non-NULL value from getGeneratedKeys
 	 1
 	 -
-	{24}
+	{32}
 Now try the same test again but this time with Statement.executeUpdate. It should behave the same
 	 1
 	 -
-	{24}
+	{32}
 Now try the same test again but this time with PreparedStatement.execute. It should behave the same
 	 1
 	 -
-	{24}
+	{32}
 Now try the same test again but this time with PreparedStatement.executeUpdate. It should behave the same
 	 1
 	 -
-	{24}
+	{32}
 Test 13 - try savepoint rollback and see what happens to auto generated keys resultset
 Inside the savepoint unit, issue a one-row insert into a table with auto generated keys
 We should get a resultset with one row of non-NULL value
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/floattypes.out b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/floattypes.out
index b00ae8ab8..281d407e9 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/floattypes.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/floattypes.out
@@ -50,13 +50,13 @@ ij> values cast (1 as dec(5));
 ------
 1     
 ij> values cast (1.1 as dec(5,3));
-1       
---------
-1.100   
+1      
+-------
+1.100  
 ij> values cast (1.1 as numeric(5,3));
-1       
---------
-1.100   
+1      
+-------
+1.100  
 ij> -- cast to all valid types
 values cast (1.1 as int);
 1          
@@ -393,15 +393,15 @@ ij> select cast(d as double precision) from tmp;
 1.0                   
 1.0                   
 ij> select cast(d as dec(10,2)) from tmp;
-1            
--------------
-1.00         
-1.00         
+1           
+------------
+1.00        
+1.00        
 ij> select cast(d as dec(10,8)) from tmp;
-1            
--------------
-1.00000000   
-1.00000000   
+1           
+------------
+1.00000000  
+1.00000000  
 ij> drop table tmp;
 0 rows inserted/updated/deleted
 ij> drop table t;
@@ -440,12 +440,12 @@ ij> insert into t values (0,		-- int
 						 );
 1 row inserted/updated/deleted
 ij> select dc from t;
-DC           
--------------
-NULL         
-10.00        
--10.00       
-0.00         
+DC          
+------------
+NULL        
+10.00       
+-10.00      
+0.00        
 ij> select dc + i, dc + s, dc + r, dc + dc from t;
 1               |2             |3            |4             
 ------------------------------------------------------------
@@ -484,11 +484,11 @@ NULL                  |NULL
 0.0                   |0.0                   
 ij> -- test null/null, constant/null, null/constant
 select dc, i / dc, 10 / dc, dc / 10e0 from t;
-DC           |2                                 |3                                 |4                     
-----------------------------------------------------------------------------------------------------------
-NULL         |NULL                              |NULL                              |NULL                  
-10.00        |1.0000000000000000000             |1.0000000000000000000             |1.0                   
--10.00       |1.0000000000000000000             |-1.0000000000000000000            |-1.0                  
+DC          |2                                 |3                                 |4                     
+---------------------------------------------------------------------------------------------------------
+NULL        |NULL                              |NULL                              |NULL                  
+10.00       |1.0000000000000000000             |1.0000000000000000000             |1.0                   
+-10.00      |1.0000000000000000000             |-1.0000000000000000000            |-1.0                  
 ERROR 22012: Attempt to divide by zero.
 ij> -- test for divide by 0
 select dc / i from t;
@@ -507,20 +507,20 @@ ij> select 20e0 / 5e0 / 4e0, 20e0 / 4e0 / 5 from t;
 1.0                   |1.0                   
 ij> -- test positive/negative, negative/positive and negative/negative
 select dc, dc / -dc, (-dc) / dc, (-dc) / -dc from t;
-DC           |2                                 |3                                 |4                                 
-----------------------------------------------------------------------------------------------------------------------
-NULL         |NULL                              |NULL                              |NULL                              
-10.00        |-1.000000000000000000000          |-1.000000000000000000000          |1.000000000000000000000           
--10.00       |-1.000000000000000000000          |-1.000000000000000000000          |1.000000000000000000000           
+DC          |2                                 |3                                 |4                                 
+---------------------------------------------------------------------------------------------------------------------
+NULL        |NULL                              |NULL                              |NULL                              
+10.00       |-1.000000000000000000000          |-1.000000000000000000000          |1.000000000000000000000           
+-10.00      |-1.000000000000000000000          |-1.000000000000000000000          |1.000000000000000000000           
 ERROR 22012: Attempt to divide by zero.
 ij> -- test some "more complex" expressions
 select dc, dc + 10e0, dc - (10 - 20e0), dc - 10, dc - (20 - 10) from t;
-DC           |2                     |3                     |4               |5               
----------------------------------------------------------------------------------------------
-NULL         |NULL                  |NULL                  |NULL            |NULL            
-10.00        |20.0                  |20.0                  |0.00            |0.00            
--10.00       |0.0                   |0.0                   |-20.00          |-20.00          
-0.00         |10.0                  |10.0                  |-10.00          |-10.00          
+DC          |2                     |3                     |4               |5               
+--------------------------------------------------------------------------------------------
+NULL        |NULL                  |NULL                  |NULL            |NULL            
+10.00       |20.0                  |20.0                  |0.00            |0.00            
+-10.00      |0.0                   |0.0                   |-20.00          |-20.00          
+0.00        |10.0                  |10.0                  |-10.00          |-10.00          
 ij> -- make sure we get the right scale/precision during arithmetic
 values (9.0 + 9.0);
 1     
@@ -621,9 +621,9 @@ ij> --try a tiny number
 --		 cast(1.7e308 as dec(2147483647))));
 --
 values cast(1 as dec(31, 20));
-1                                 
-----------------------------------
-1.00000000000000000000            
+1                                
+---------------------------------
+1.00000000000000000000           
 ij> -- test the arithmetic operators on a type we know they don't work on
 create table w (x dec, y long varchar);
 0 rows inserted/updated/deleted
@@ -651,314 +651,314 @@ insert into t values (123,			-- int
 1 row inserted/updated/deleted
 ij> -- test =
 select dc from t where dc is null;
-DC           
--------------
-NULL         
+DC          
+------------
+NULL        
 ij> select dc from t where dc = 10;
-DC           
--------------
-10.00        
+DC          
+------------
+10.00       
 ij> select dc from t where dc = -10;
-DC           
--------------
--10.00       
+DC          
+------------
+-10.00      
 ij> select dc from t where dc = 0;
-DC           
--------------
-0.00         
+DC          
+------------
+0.00        
 ij> select dc from t where dc = 1234.45;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc = i;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc = l;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc = s;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc = r;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc = d;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc = dc;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> -- test >
 select dc from t where dc > 10;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc > -10;
-DC           
--------------
-10.00        
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+0.00        
+1234.56     
 ij> select dc from t where dc > 0;
-DC           
--------------
-10.00        
-1234.56      
+DC          
+------------
+10.00       
+1234.56     
 ij> select dc from t where dc > 1234.45;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc > i;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc > l;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc > s;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc > r;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc > d;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc > dc;
-DC           
--------------
+DC          
+------------
 ij> -- test >=
 select dc from t where dc >= 10;
-DC           
--------------
-10.00        
-1234.56      
+DC          
+------------
+10.00       
+1234.56     
 ij> select dc from t where dc >= -10;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc >= 0;
-DC           
--------------
-10.00        
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+0.00        
+1234.56     
 ij> select dc from t where dc >= 1234.45;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc >= i;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc >= l;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc >= s;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc >= r;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc >= d;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc >= dc;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> -- test <
 select dc from t where dc < 10;
-DC           
--------------
--10.00       
-0.00         
+DC          
+------------
+-10.00      
+0.00        
 ij> select dc from t where dc < -10;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc < 0;
-DC           
--------------
--10.00       
+DC          
+------------
+-10.00      
 ij> select dc from t where dc < 1234.45;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc < i;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc < l;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc < s;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc < r;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc < d;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc < dc;
-DC           
--------------
+DC          
+------------
 ij> -- test <=
 select dc from t where dc <= 10;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc <= -10;
-DC           
--------------
--10.00       
+DC          
+------------
+-10.00      
 ij> select dc from t where dc <= 0;
-DC           
--------------
--10.00       
-0.00         
+DC          
+------------
+-10.00      
+0.00        
 ij> select dc from t where dc <= 1234.45;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc <= i;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc <= l;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc <= s;
-DC           
--------------
-10.00        
--10.00       
-0.00         
+DC          
+------------
+10.00       
+-10.00      
+0.00        
 ij> select dc from t where dc <= r;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc <= d;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc <= dc;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> -- test <>
 select dc from t where dc <> 10;
-DC           
--------------
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc <> -10;
-DC           
--------------
-10.00        
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+0.00        
+1234.56     
 ij> select dc from t where dc <> 0;
-DC           
--------------
-10.00        
--10.00       
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+1234.56     
 ij> select dc from t where dc <> 1234.45;
-DC           
--------------
-10.00        
--10.00       
-0.00         
-1234.56      
+DC          
+------------
+10.00       
+-10.00      
+0.00        
+1234.56     
 ij> select dc from t where dc <> i;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc <> l;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc <> s;
-DC           
--------------
-1234.56      
+DC          
+------------
+1234.56     
 ij> select dc from t where dc <> r;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc <> d;
-DC           
--------------
+DC          
+------------
 ij> select dc from t where dc <> dc;
-DC           
--------------
+DC          
+------------
 ij> --
 -- test a variety of inserts and updates
 --
@@ -982,65 +982,65 @@ ij> -- now do updates and confirm they are ok
 update t2 set dc = dc + 1.1;
 5 rows inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
--8.90        
-1.10         
-11.10        
-1235.66      
-NULL         
+DC          
+------------
+-8.90       
+1.10        
+11.10       
+1235.66     
+NULL        
 ij> update t2 set dc = dc - 1.1;
 5 rows inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
--10.00       
-0.00         
-10.00        
-1234.56      
-NULL         
+DC          
+------------
+-10.00      
+0.00        
+10.00       
+1234.56     
+NULL        
 ij> update t2 set dc = dc / 1.1;
 5 rows inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
--9.09        
-0.00         
-9.09         
-1122.32      
-NULL         
+DC          
+------------
+-9.09       
+0.00        
+9.09        
+1122.32     
+NULL        
 ij> update t2 set dc = dc * 1.1;
 5 rows inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
--9.99        
-0.00         
-9.99         
-1234.55      
-NULL         
+DC          
+------------
+-9.99       
+0.00        
+9.99        
+1234.55     
+NULL        
 ij> -- try some deletes
 delete from t2 where dc > 0;
 2 rows inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
--9.99        
-0.00         
-NULL         
+DC          
+------------
+-9.99       
+0.00        
+NULL        
 ij> delete from t2 where dc = 0;
 1 row inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
--9.99        
-NULL         
+DC          
+------------
+-9.99       
+NULL        
 ij> delete from t2 where dc < 0;
 1 row inserted/updated/deleted
 ij> select dc from t2;
-DC           
--------------
-NULL         
+DC          
+------------
+NULL        
 ij> drop table t2;
 0 rows inserted/updated/deleted
 ij> drop table t;
@@ -1074,33 +1074,33 @@ ij> insert into t values ('a', 99999999999999.123, 'Z');
 ij> insert into t values ('a', 9.123, 'Z');
 1 row inserted/updated/deleted
 ij> select * from t;
-C1  |D                      |C2  
----------------------------------
-a   |1.1230                 |Z   
-a   |11111.1230             |Z   
-a   |11111111.1230          |Z   
-a   |6.1230                 |Z   
-a   |666.1230               |Z   
-a   |0.6000                 |Z   
-a   |0.0000                 |Z   
-a   |666666.1230            |Z   
-a   |99999999999999.1230    |Z   
-a   |9.1230                 |Z   
+C1  |D                     |C2  
+--------------------------------
+a   |1.1230                |Z   
+a   |11111.1230            |Z   
+a   |11111111.1230         |Z   
+a   |6.1230                |Z   
+a   |666.1230              |Z   
+a   |0.6000                |Z   
+a   |0.0000                |Z   
+a   |666666.1230           |Z   
+a   |99999999999999.1230   |Z   
+a   |9.1230                |Z   
 ij> update t set d = d + .0007;
 10 rows inserted/updated/deleted
 ij> select * from t;
-C1  |D                      |C2  
----------------------------------
-a   |1.1237                 |Z   
-a   |11111.1237             |Z   
-a   |11111111.1237          |Z   
-a   |6.1237                 |Z   
-a   |666.1237               |Z   
-a   |0.6007                 |Z   
-a   |0.0007                 |Z   
-a   |666666.1237            |Z   
-a   |99999999999999.1237    |Z   
-a   |9.1237                 |Z   
+C1  |D                     |C2  
+--------------------------------
+a   |1.1237                |Z   
+a   |11111.1237            |Z   
+a   |11111111.1237         |Z   
+a   |6.1237                |Z   
+a   |666.1237              |Z   
+a   |0.6007                |Z   
+a   |0.0007                |Z   
+a   |666666.1237           |Z   
+a   |99999999999999.1237   |Z   
+a   |9.1237                |Z   
 ij> drop table tmp;
 ERROR 42Y55: 'DROP TABLE' cannot be performed on 'TMP' because it does not exist.
 ij> drop table bad;
@@ -2444,87 +2444,87 @@ ij> insert into tiger values (0.00000001234);
 ij> insert into tiger values (0.00000001234);
 1 row inserted/updated/deleted
 ij> select d from tiger order by 1;
-D              
----------------
-0.00000001234  
-0.00000001234  
-0.00000012340  
-0.00000123400  
-0.00001234000  
-0.00012340000  
-0.00123400000  
-0.00123400000  
-0.01234000000  
-0.12340000000  
-1.23400000000  
+D             
+--------------
+0.00000001234 
+0.00000001234 
+0.00000012340 
+0.00000123400 
+0.00001234000 
+0.00012340000 
+0.00123400000 
+0.00123400000 
+0.01234000000 
+0.12340000000 
+1.23400000000 
 ij> -- =====================================================
 -- some formatting tests
 values cast ('1e+0' as DECIMAL(6,2));
-1        
----------
-1.00     
+1       
+--------
+1.00    
 ij> values cast ('+-1e+1' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('-1e+1' as DECIMAL(6,2));
-1        
----------
--10.00   
+1       
+--------
+-10.00  
 ij> values cast ('-1e-1' as DECIMAL(6,2));
-1        
----------
--0.10    
+1       
+--------
+-0.10   
 ij> values cast ('-1e-+1' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('-1e--1' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('-1e+-1' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('-1e+-1' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('1.0e' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('1.0e+' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('1.0e-' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('1.0ee' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('123.' as DECIMAL(6,2));
-1        
----------
-123.00   
+1       
+--------
+123.00  
 ij> values cast ('1e' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('1e1.0' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> values cast ('.3' as DECIMAL(6,2));
-1        
----------
-0.30     
+1       
+--------
+0.30    
 ij> values cast ('' as DECIMAL(6,2));
-1        
----------
+1       
+--------
 ERROR 22018: Invalid character string format for type DECIMAL.
 ij> 
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/iepnegativetests_ES.out b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/iepnegativetests_ES.out
index f9e54ec9f..363a9c0b5 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/iepnegativetests_ES.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/iepnegativetests_ES.out
@@ -17,17 +17,17 @@ ERROR XIE0I: Se ha producido una excepci EnC:>243< n de E/S al grabar datos en e
 ij> --export table not found
 call SYSCS_UTIL.SYSCS_EXPORT_TABLE ('IEP', 'NOTABLE' , 'extinout/t1.dat' , 
                                  null, null, null) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: La tabla 'IEP.NOTABLE' no existe.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: La tabla 'IEP.NOTABLE' no existe.' al evaluar una expresi EnC:>243< n.
 ERROR 42X05: La tabla 'IEP.NOTABLE' no existe.
 ij> ---export schema is not valid
 call SYSCS_UTIL.SYSCS_EXPORT_TABLE ('XXXX', 'T1' , 'extinout/t1.dat' , 
                                  null, null, null) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: El esquema 'XXXX' no existe.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: El esquema 'XXXX' no existe.' al evaluar una expresi EnC:>243< n.
 ERROR 42Y07: El esquema 'XXXX' no existe.
 ij> --export query is invalid (syntax error)
 call SYSCS_UTIL.SYSCS_EXPORT_QUERY('select from t1', 
                                     'extinout/t1.dat' , null, null, null) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: Error de sintaxis: Encountered "from" at line 1, column 8.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: Error de sintaxis: Encountered "from" at line 1, column 8.' al evaluar una expresi EnC:>243< n.
 ERROR 42X01: Error de sintaxis: Encountered "from" at line 1, column 8.
 ij> --export codeset is invalid
 call SYSCS_UTIL.SYSCS_EXPORT_QUERY('select * from iep.t1', 
@@ -35,7 +35,7 @@ call SYSCS_UTIL.SYSCS_EXPORT_QUERY('select * from iep.t1',
 ERROR XIE0I: Se ha producido una excepci EnC:>243< n de E/S al grabar datos en el archivo.
 ij> call SYSCS_UTIL.SYSCS_EXPORT_TABLE ('XXXX', 'T1' , 'extinout/t1.dat' , 
                                  null, null, null) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: El esquema 'XXXX' no existe.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: El esquema 'XXXX' no existe.' al evaluar una expresi EnC:>243< n.
 ERROR 42Y07: El esquema 'XXXX' no existe.
 ij> --export delimiter errror cases
 --period can not be used as character ot column delimiter
@@ -96,7 +96,7 @@ ij> --import error cases
 --import can not find input file
 call SYSCS_UTIL.SYSCS_IMPORT_TABLE('IEP', 'T1' , 'extin/nodir/t1.dat' , 
                                  null, null, null, 0) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.' al evaluar una expresi EnC:>243< n.
 ERROR 38000: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.
 ERROR XJ001: Excepci EnC:>243< n de Java: ': java.lang.reflect.InvocationTargetException'.
 ERROR XIE04: Archivo de datos no encontrado: extin/nodir/t1.dat
@@ -110,7 +110,7 @@ call SYSCS_UTIL.SYSCS_IMPORT_TABLE ('XXXX', 'T1' , 'extinout/t1.dat' ,
 ERROR XIE0M: La tabla 'XXXX.T1' no existe. 
 ij> call SYSCS_UTIL.SYSCS_IMPORT_TABLE ('IEP', 'T1' , 'extinout/t1.dat' , 
                                  null, null, 'INCORRECTCODESET', 0) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.' al evaluar una expresi EnC:>243< n.
 ERROR 38000: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.
 ERROR XJ001: Excepci EnC:>243< n de Java: ': java.lang.reflect.InvocationTargetException'.
 ERROR XJ001: Excepci EnC:>243< n de Java: 'java.io.UnsupportedEncodingException: INCORRECTCODESET'.
@@ -119,20 +119,20 @@ ij> --check import with invalid delimiter usage
 --and the that should become a invalid delimiter 
 call SYSCS_UTIL.SYSCS_IMPORT_TABLE ('IEP', 'T1' , 'extinout/t1.dat' , 
                                  '', ';', null, 0) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.' al evaluar una expresi EnC:>243< n.
 ERROR 38000: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.
 ERROR XJ001: Excepci EnC:>243< n de Java: ': java.lang.reflect.InvocationTargetException'.
 ERROR XIE0J: Un delimitador no es v EnC:>225< lido o se ha utilizado m EnC:>225< s de una vez.
 ij> call SYSCS_UTIL.SYSCS_IMPORT_TABLE ('IEP', 'T1' , 'extinout/t1.dat' , 
                                  null, '', null, 0) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.' al evaluar una expresi EnC:>243< n.
 ERROR 38000: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.
 ERROR XJ001: Excepci EnC:>243< n de Java: ': java.lang.reflect.InvocationTargetException'.
 ERROR XIE0J: Un delimitador no es v EnC:>225< lido o se ha utilizado m EnC:>225< s de una vez.
 ij> --same delimter can not be used as character and column delimters
 call SYSCS_UTIL.SYSCS_IMPORT_TABLE ('IEP', 'T1' , 'extinout/t1.dat' , 
                                  ';', ';', null, 1) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.' al evaluar una expresi EnC:>243< n.
 ERROR 38000: Se he generado la excepci EnC:>243< n 'java.lang.reflect.InvocationTargetException' al evaluar una expresi EnC:>243< n.
 ERROR XJ001: Excepci EnC:>243< n de Java: ': java.lang.reflect.InvocationTargetException'.
 ERROR XIE0J: Un delimitador no es v EnC:>225< lido o se ha utilizado m EnC:>225< s de una vez.
@@ -241,12 +241,12 @@ ij> --import data column indexes count > insert columns count
 call SYSCS_UTIL.SYSCS_IMPORT_DATA('IEP', 'T3' , 'C1, C2, C3,C4', '1,2', 
                                  'extinout/t3.dat' , 
                                  null, null, null, 0) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: El n EnC:>250< mero de valores asignado no coincide con el n EnC:>250< mero de columnas especificadas o impl EnC:>237< citas.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: El n EnC:>250< mero de valores asignado no coincide con el n EnC:>250< mero de columnas especificadas o impl EnC:>237< citas.' al evaluar una expresi EnC:>243< n.
 ERROR 42802: El n EnC:>250< mero de valores asignado no coincide con el n EnC:>250< mero de columnas especificadas o impl EnC:>237< citas.
 ij> call SYSCS_UTIL.SYSCS_IMPORT_DATA('IEP', 'T3' , null, '11,22,12,24', 
                                  'extinout/t3.dat' , 
  EnC:>9<  EnC:>9<  EnC:>9<  EnC:>9<  null, null, null, 0) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: La columna 'COLUMN11' no est EnC:>225<  en ninguna tabla de la lista FROM o aparece en una especificaci EnC:>243< n de uni EnC:>243< n y est EnC:>225<  fuera del  EnC:>225< mbito de la especificaci EnC:>243< n de uni EnC:>243< n o bien aparece en una cl EnC:>225< usula HAVING y no est EnC:>225<  en la lista GROUP BY. Si se trata de una sentencia CREATE o ALTER TABLE entonces 'COLUMN11' no es una columna de la tabla destino.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: La columna 'COLUMN11' no est EnC:>225<  en ninguna tabla de la lista FROM o aparece en una especificaci EnC:>243< n de uni EnC:>243< n y est EnC:>225<  fuera del  EnC:>225< mbito de la especificaci EnC:>243< n de uni EnC:>243< n o bien aparece en una cl EnC:>225< usula HAVING y no est EnC:>225<  en la lista GROUP BY. Si se trata de una sentencia CREATE o ALTER TABLE entonces 'COLUMN11' no es una columna de la tabla destino.' al evaluar una expresi EnC:>243< n.
 ERROR 42X04: La columna 'COLUMN11' no est EnC:>225<  en ninguna tabla de la lista FROM o aparece en una especificaci EnC:>243< n de uni EnC:>243< n y est EnC:>225<  fuera del  EnC:>225< mbito de la especificaci EnC:>243< n de uni EnC:>243< n o bien aparece en una cl EnC:>225< usula HAVING y no est EnC:>225<  en la lista GROUP BY. Si se trata de una sentencia CREATE o ALTER TABLE entonces 'COLUMN11' no es una columna de la tabla destino.
 ij> --repeat the above type cases with empty file and minor variation to paramters
 delete from t3 ;
@@ -272,7 +272,7 @@ ij> --import data column indexes count > insert columns count
 call SYSCS_UTIL.SYSCS_IMPORT_DATA('IEP', 'T3' , null, '1,2', 
                                  'extinout/t3.dat' , 
  EnC:>9<  EnC:>9<  EnC:>9<  EnC:>9<     ';', '^', 'utf-16', 1) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: El n EnC:>250< mero de valores asignado no coincide con el n EnC:>250< mero de columnas especificadas o impl EnC:>237< citas.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: El n EnC:>250< mero de valores asignado no coincide con el n EnC:>250< mero de columnas especificadas o impl EnC:>237< citas.' al evaluar una expresi EnC:>243< n.
 ERROR 42802: El n EnC:>250< mero de valores asignado no coincide con el n EnC:>250< mero de columnas especificadas o impl EnC:>237< citas.
 ij> --specify column indexes that are not there in the file that is being  imported
 call SYSCS_UTIL.SYSCS_IMPORT_DATA('IEP', 'T3' , null, '11,22,12,24', 
@@ -282,7 +282,7 @@ call SYSCS_UTIL.SYSCS_IMPORT_DATA('IEP', 'T3' , null, '11,22,12,24',
 ij> --import to a system table shoud fail
 call SYSCS_UTIL.SYSCS_IMPORT_TABLE ('SYS', 'SYSTABLES' , 'extinout/t3.dat' , 
                                       ';', '^', 'utf-16', 1) ;
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: 'SYS.SYSTABLES' es una tabla del sistema. Los usuarios no tienen permitido modificar el contenido de esta tabla.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: 'SYS.SYSTABLES' es una tabla del sistema. Los usuarios no tienen permitido modificar el contenido de esta tabla.' al evaluar una expresi EnC:>243< n.
 ERROR 42Y25: 'SYS.SYSTABLES' es una tabla del sistema. Los usuarios no tienen permitido modificar el contenido de esta tabla.
 ij> ---not supported by db2 cloudscape import/export
 create table ntype(a int , ct CLOB(1024));
@@ -323,7 +323,7 @@ ij(C2)> --following import should fail with lock time out
 call SYSCS_UTIL.SYSCS_SET_DATABASE_PROPERTY('derby.locks.waitTimeout', '5');
 0 rows inserted/updated/deleted
 ij(C2)> CALL SYSCS_UTIL.SYSCS_IMPORT_TABLE('IEP', 'PARENT', 'extinout/parent.del',null, null, null,1);
-ERROR 38000: Se he generado la excepci EnC:>243< n 'SQL Exception: La tabla 'IEP.PARENT' no se puede bloquear en modalidad 'EXCLUSIVE'.' al evaluar una expresi EnC:>243< n.
+ERROR 38000: Se he generado la excepci EnC:>243< n 'java.sql.SQLException: La tabla 'IEP.PARENT' no se puede bloquear en modalidad 'EXCLUSIVE'.' al evaluar una expresi EnC:>243< n.
 ERROR X0X02: La tabla 'IEP.PARENT' no se puede bloquear en modalidad 'EXCLUSIVE'.
 ERROR 40XL1: No se ha podido obtener un bloqueo dentro del tiempo solicitado
 ij(C2)> disconnect c1;
diff --git a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/resultset.out b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/resultset.out
index 0155c402b..d5adaeb9a 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/resultset.out
+++ b/java/testing/org/apache/derbyTesting/functionTests/master/j9_foundation/resultset.out
@@ -177,7 +177,7 @@ isSearchable(10): true
 isCurrency(10): true
 isNullable(10): 1
 isSigned(10): true
-getColumnDisplaySize(10): 13
+getColumnDisplaySize(10): 12
 getColumnLabel(10): DC
 getColumnName(10): DC
 getTableName(10): T
diff --git a/java/testing/org/apache/derbyTesting/functionTests/tests/lang/floattypes_app.properties b/java/testing/org/apache/derbyTesting/functionTests/tests/lang/floattypes_app.properties
index 5c508089b..d74cc93ae 100644
--- a/java/testing/org/apache/derbyTesting/functionTests/tests/lang/floattypes_app.properties
+++ b/java/testing/org/apache/derbyTesting/functionTests/tests/lang/floattypes_app.properties
@@ -1,6 +1,5 @@
 #
 # This is the default system properties file for SQL and JAVA tests.
-# but modified to prevent this test from running with jdk131
 #
 ij.database=jdbc:derby:wombat;create=true
 ij.protocol=jdbc:derby:
@@ -13,6 +12,10 @@ ij.showNoCountForSelect=true
 ij.dataSource.databaseName=wombat
 ij.dataSource.createDatabase=create
 
+#
+# But modified to prevent this test from running with jdk131-based-DriverManager-using jvms 
+# because of odd failures, see DERBY-804
+#
 runwithjdk13=false
 runwithibm13=false
 runwithj9=false
